[
  {
    "catalog": "ct_sm_chatbot_auxo",
    "schema": "claims_summaries",
    "table": {
      "table_name": "patient_lot",
      "table_description": "What this table is\n- This table provides patient-level, claim-derived summaries that track treatment “lines” and associated product/regimen usage for individual patients. \n- Each record represents a single patient’s summary for a specific treatment line (or the current activity/lot associated with that patient). The data are aggregated from claims and intended for business analyses such as utilization, patient segmentation, adherence, product/lot tracking, and provider network analysis.\n\nHow the table is typically used\n- Monitor which regimens/products patients are using and when each treatment line started and ended.\n- Measure utilization and persistence (days supplied, active status, months with claims).\n- Count distinct providers, regimens and products seen by a patient—useful for care coordination and referral analysis.\n- Identify the most-used product per patient and whether the patient is newly initiated.\n- Group or filter patients by “lot” or cohort labels (CURRENT_LOT / LATEST_LOT) for campaign, inventory or cohort analyses.\n\nColumn-by-column, business-friendly definitions\n- PATIENT_ID: De-identified patient identifier (one ID per patient).\n- PAT_AGE: Patient age (as of the reference date when the summary was created).\n- GENDER_DESC: Patient gender description (e.g., Male, Female, Other/Unknown).\n- LINE_NO: Treatment line number (e.g., 1 for first-line therapy, 2 for second-line).\n- REGIMEN_NAME: Name or label of the treatment regimen associated with this line.\n- LINE_START: Start date of this treatment line (first claim/service date for the line).\n- LINE_END: End date of this treatment line (last claim/service date for the line), if applicable.\n- IS_ACTIVE: Flag indicating whether this treatment line is currently active (true/false).\n- CURRENT_LOT: The patient’s current lot/cohort label or batch assignment (business-defined grouping).\n- LATEST_LOT: The most recent lot/cohort the patient was included in (may differ from CURRENT_LOT if reassigned).\n- UNIQ_CLAIM_COUNTS: Number of unique claims contributing to this summary (claim events count).\n- UNIQ_PROVIDERS_COUNT: Count of distinct providers seen by the patient in this context.\n- UNIQ_REGIMEN_COUNT: Number of distinct regimens the patient has received (shows regimen changes).\n- UNIQ_PRODUCT_COUNT: Number of distinct products (drugs/devices) used by the patient.\n- AVG_DAYS_SUPPLY_UPD: Average days’ supply per prescription or dispense (updated/normalized).\n- NO_OF_UNIQ_MONTHS: Number of unique calendar months in which the patient had qualifying claims (measure of persistence/continuity).\n- MOST_USED_PROD: Identifier or name of the product the patient used most frequently in the period.\n- MOST_USED_PROD_COUNT: Count of fills/claims for the most-used product.\n- IS_NEW: Flag indicating whether the patient is newly initiated (new to therapy/cohort) in the reporting window.\n\nNotes and interpretation tips\n- Records are aggregated from claims-level data; dates and counts reflect what is available in the claims feed.\n- “Lot” fields are business-defined cohort/batch labels—confirm the lot naming convention with the business owner before using for operational decisions.\n- Use UNIQ_* metrics and AVG_DAYS_SUPPLY_UPD to assess adherence, persistence, and fragmentation of care (multiple providers or regimen switches).\n- PATIENT_ID is expected to be de-identified for privacy; do not attempt to re-identify patients.",
      "columns": [
        {
          "column_name": "PATIENT_ID",
          "data_type": "STRING",
          "description": "Concise business description — PATIENT_ID\n\n- Meaning: A unique identifier for a patient used to link claims and summary data. This value represents the patient record (or a de-identified surrogate) rather than any personal attribute (name, SSN, DOB).\n- Purpose: Use for joins, grouping, de-duplication and tracking a patient’s claims across records and reporting batches.\n- Expected format: an opaque string (alphanumeric, may include dashes). Common patterns include a system GUID/UUID (e.g., a3f47b12-9c3e-4b2f-8f1d-0e2a7c9d5f6b), a hashed/pseudonymized MRN, or a fixed-prefix code (e.g., PAT00012345). Typical length: ~8–36 characters.\n- Constraints and usage notes:\n  - Must be non-null and unique per patient within the dataset/batch.\n  - Should be stable/persistent across extracts so longitudinal joins are reliable.\n  - Treat as sensitive (PHI) if it is reversible or linkable to real identities; apply appropriate access controls and encryption.\n  - Stored as case-sensitive string; avoid embedding semantic info (no embedded DOBs or meaningful codes).\n- Example values: 12345678, PAT00098765, a3f47b12-9c3e-4b2f-8f1d-0e2a7c9d5f6b."
        },
        {
          "column_name": "PAT_AGE",
          "data_type": "STRING",
          "description": "Business definition\n- PAT_AGE is the patient’s age associated with the claim/summary record — i.e., the age of the patient at the time of service or the claim event.\n\nExpected format and content\n- Stored as a string but represents age in years.\n- Preferred canonical form: whole years as numeric characters (e.g., \"0\", \"1\", \"45\", \"87\").\n- Possible non‑numeric variants that may appear and should be handled:\n  - Ranges or capped values: \"90+\", \"100+\".\n  - Newborns/infants: \"<1\", \"0\" or ages expressed in months (\"3M\") or days (\"14D\") — these should be normalized if needed.\n  - Missing/unknown: \"\", \"NULL\", \"UNK\", \"N/A\".\n  - Textual suffixes: \"45 yrs\", \"45 years\", \"45 Y\" — should be stripped/normalized.\n\nValidation rules and recommendations\n- Normalize to an integer years field for analysis: strip units/suffixes, map ranges/caps to numeric or categorical (e.g., \"90+\" -> 90 or a \"90+\" category), convert \"<1\"/months/days into 0 or use an age-in-days/months field if fine granularity required.\n- Enforce plausible bounds (e.g., 0–120). Flag outliers and non‑numeric entries for review.\n- Treat blank/explicit unknowns as NULL.\n\nPrivacy note\n- For regulatory/privacy compliance, records of very old ages may be masked (e.g., ages 90+), so expect capped values in some datasets."
        },
        {
          "column_name": "GENDER_DESC",
          "data_type": "STRING",
          "description": "Purpose\n- Human-readable gender label for the patient; a categorical description derived from patient demographics used for reporting, filtering and analytics.\n\nExpected content / values\n- Short categorical values such as: \"Male\", \"Female\", \"Other\", \"Non‑Binary\", \"Unknown\", \"Not Specified\" (or similar standardized labels). Legacy single-letter values (\"M\", \"F\") may appear but should be normalized where possible.\n\nFormat and rules\n- Data type: STRING.\n- Stored as a short text token (recommended max length 20–50 characters).\n- Prefer a controlled vocabulary (capitalization consistent, e.g., Title Case or UPPER) to avoid duplicates.\n- Nulls or \"Unknown\"/\"Not Specified\" indicate missing/uncollected gender information.\n- Note: This field contains a gender descriptor (identity label) and should be treated as demographic — apply privacy controls appropriate for patient data."
        },
        {
          "column_name": "LINE_NO",
          "data_type": "STRING",
          "description": "Business description:\n- LINE_NO identifies a specific service or detail line within a patient’s claim/lot. It distinguishes multiple line items (procedures, services, revenue codes) that belong to the same claim or patient_lot record and is used to join or aggregate line-level data.\n\nExpected format:\n- Stored as a string but represents a sequential integer (the line index) for the claim/lot.\n- Typical values: \"1\", \"2\", \"3\", … (occasionally zero‑padded like \"01\" or \"001\" in some sources).\n- Should contain only digits (no decimals, letters, or special characters) unless your source system uses an alphanumeric code.\n- Uniqueness is usually scoped to the claim or patient_lot (i.e., LINE_NO combined with the claim/patient_lot identifier identifies a single line).\n\nExamples:\n- \"1\", \"2\", \"10\" (or \"01\", \"02\" if zero-padded)."
        },
        {
          "column_name": "REGIMEN_NAME",
          "data_type": "STRING",
          "description": "Business definition\n- REGIMEN_NAME is the human‑readable name of the treatment regimen associated with the patient lot in the claims summaries table. It identifies the therapeutic regimen (drug, drug combination, or non‑drug care pathway) given to the patient or patient cohort.\n\nExpected format and rules\n- Type: string (plain text); can be NULL if regimen is unknown or not applicable.\n- Content: a concise, standardized regimen name or code — not dosing, frequency, or billing codes.\n- Normalization: use a controlled/internal regimen list or established oncology abbreviations where possible (e.g., FOLFOX, R‑CHOP). Prefer uppercase for consistency.\n- Combinations: separate multiple agents with \" + \" or \"/\" (e.g., BEVACIZUMAB + FOLFIRI, CARBOPLATIN/PEMETREXED).\n- Line or intent: if needed, append short qualifiers in parentheses (e.g., \"(1L)\", \"(adjuvant)\", \"(palliative)\").\n- Disallowed: do not include numeric dose, route, or schedule details (e.g., \"50 mg IV q3w\" should not be stored here); avoid embedding patient identifiers or free‑text notes.\n\nExamples\n- FOLFOX\n- R‑CHOP\n- BEVACIZUMAB + FOLFIRI (2L)\n- HORMONE THERAPY (LETROZOLE)\n- PALLIATIVE CARE\n\nRecommended practice\n- Map REGIMEN_NAME values to a canonical regimen dictionary (or RxNorm/SNOMED where appropriate) to support aggregation, reporting, and analytics."
        },
        {
          "column_name": "LINE_START",
          "data_type": "STRING",
          "description": "Business description\n- Purpose: LINE_START identifies the text that marks the beginning of the first line for a patient_lot record. It is used to capture the leading token/label/marker for that record’s multi-line summary so downstream processes can detect, sort or display the record’s starting line.\n\nExpected format and examples\n- Data type: STRING (short, single-line text; no embedded newlines).\n- Typical contents:\n  - a numeric sequence/position expressed as a string, e.g. \"1\", \"0001\"\n  - a date/time stamp (recommended ISO 8601), e.g. \"2024-01-05\" or \"2024-01-05T08:00:00Z\"\n  - a short label or token that denotes the start, e.g. \"LotStart\", \"Patient: John Doe\"\n- Examples: \"1\", \"2024-06-15T09:30:00Z\", \"Lot-ABC123\", \"Start\"\n\nRecommended validation/normalization\n- Must be a single-line string (no newline characters).\n- Trim leading/trailing whitespace.\n- Keep length reasonable (e.g., <= 255 characters).\n- If the value is a date/time, store in ISO 8601 for consistency.\n- If the value represents a numeric index, prefer zero-padded digits (e.g., \"0001\") or store a separate numeric column if arithmetic/sorting is required."
        },
        {
          "column_name": "LINE_END",
          "data_type": "STRING",
          "description": "Business description\n- LINE_END is the service/coverage end date for a claim “line” (the last calendar day that the item/service/coverage represented by this patient_lot record was effective). It indicates when the billing/service period for that line terminated (or the line became inactive) for adjudication, reporting and eligibility calculations.\n\nExpected format and rules\n- Stored as a string but should represent a date in ISO 8601 date form: YYYY-MM-DD (e.g., 2025-03-31).\n- Optional time or timezone components are not expected; if timestamps are present they should follow ISO 8601 (e.g., 2025-03-31T23:59:59Z).\n- Null or empty = no known end date / open-ended.\n- Date must be a valid calendar date and normally should be >= the corresponding LINE_START date. Systems may use a sentinel like 9999-12-31 to indicate “indefinite” coverage—treat that as open-ended.\n\nExamples\n- \"2024-06-30\"\n- \"9999-12-31\" (indefinite)\n- \"\" or NULL (no end date known)"
        },
        {
          "column_name": "IS_ACTIVE",
          "data_type": "INT",
          "description": "Description\n- IS_ACTIVE is a boolean-style flag indicating whether the patient_lot record is currently active for business use (i.e., valid/current vs. inactive/archived).\n\nExpected format and values\n- Data type: INT (integer).\n- Typical values:\n  - 1 = active (currently in use / include in processing and reporting)\n  - 0 = inactive (retired/archived / exclude from regular processing)\n- NULL: may indicate unknown or not set (treat as inactive unless business rule specifies otherwise).\n\nUsage notes\n- Use this column to filter records (WHERE IS_ACTIVE = 1) for operational workflows and reports.\n- Do not infer temporal validity (effective dates) from this flag; check date fields if available for time-bound status."
        },
        {
          "column_name": "CURRENT_LOT",
          "data_type": "STRING",
          "description": "Purpose\n- CURRENT_LOT records the lot (batch) identifier of the product that was associated with a patient claim. It is used for product tracking, recalls, adverse‑event investigation, inventory reconciliation and linking to vendor/manufacturer lot records.\n\nExpected contents and format\n- Free‑form alphanumeric lot/batch code as assigned by the manufacturer or dispenser.\n- Typical characters: uppercase letters, digits, and common separators (hyphen, slash, underscore). Avoid leading/trailing spaces.\n- Recommended pattern for validation (example): /^[A-Z0-9_\\-\\/]{1,50}$/ (adjust length to source system limits).\n- Examples: \"LOT12345\", \"A1B-2023-09\", \"000123\", \"NDCLOT/98765\".\n\nNotes and business rules\n- Field is not necessarily unique; the same lot may appear for many patients.\n- If the lot is unknown, use NULL (preferred) or a standard code such as \"UNKNOWN\" per downstream conventions.\n- Normalize on ingest (trim, uppercase) to improve matching across systems."
        },
        {
          "column_name": "LATEST_LOT",
          "data_type": "STRING",
          "description": "Meaning\n- The most recent product lot (batch) identifier associated with a patient’s claim/dispensing record. It identifies the specific manufacturing batch of the drug/device dispensed to the patient and is used for traceability, recalls, safety investigations and inventory reconciliation.\n\nExpected format\n- A free-form alphanumeric lot/batch identifier stored as a string.\n- Typical contents: letters and digits, may include punctuation such as hyphens, slashes or underscores; may preserve leading zeros and mixed case as provided by the dispenser.\n- Examples: \"123456\", \"AB-98765\", \"LOT2023/01\", \"00012345A\".\n\nConstraints and usage notes\n- Single value: represents the latest (most recent) lot for that patient/claim. If multiple lots were involved and a single field is used, the most recent lot should be populated; avoid concatenating multiple lots in this field.\n- Null/unknown: may be NULL or contain placeholders like \"UNKNOWN\" or \"N/A\" when not captured.\n- Normalization recommendation: trim whitespace and optionally uppercase for consistency; do not alter leading zeros or remove meaningful punctuation.\n- Validation suggestion: allow alphanumeric plus common punctuation (e.g., regex like ^[A-Za-z0-9\\-\\_\\/]+$), but accept exceptions because lot formats vary by manufacturer and country."
        },
        {
          "column_name": "UNIQ_CLAIM_COUNTS",
          "data_type": "LONG",
          "description": "Meaning\n- The total number of distinct insurance claims associated with the given patient_lot record. This represents a deduplicated count of claim events (e.g., distinct claim IDs or claim numbers) attributable to that patient lot over the reporting window defined by the ETL.\n\nExpected format and rules\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, ...). No decimal places.\n- 0 indicates the patient lot has no recorded claims in that period; NULL indicates missing/unknown data.\n- The count is computed after deduplication according to the pipeline’s claim-identity rules (distinct claim identifier), so it should match related aggregate tables that count unique claims."
        },
        {
          "column_name": "UNIQ_PROVIDERS_COUNT",
          "data_type": "LONG",
          "description": "Business description\n- UNIQ_PROVIDERS_COUNT is the count of distinct healthcare providers associated with the claims grouped in this patient_lot. It quantifies how many unique providers (e.g., distinct NPI or internal provider_id) appear across the lot’s claims.\n\nExpected format and rules\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, …). No decimal places.\n- Calculation: count distinct provider identifiers across all claims in the patient_lot; each provider counted once even if they appear on multiple claims.\n- Null/empty handling: 0 indicates no providers found; NULL may be used if provider information is unavailable or the count was not computed.\n- Typical use: measures care fragmentation or provider network breadth for the patient_lot and supports reporting/filters that depend on number of providers."
        },
        {
          "column_name": "UNIQ_REGIMEN_COUNT",
          "data_type": "LONG",
          "description": "Short business description\n- UNIQ_REGIMEN_COUNT is the count of distinct treatment regimens associated with the patient lot in this claims summary. It measures how many different regimens (unique combinations of drugs/procedures identified by regimen code or name) were observed for that patient/lot during the reporting period and is used to indicate treatment complexity or regimen changes.\n\nExpected format and rules\n- Data type: integer (LONG).\n- Allowed values: non‑negative whole numbers (0, 1, 2, ...).  \n- Nullability: may be NULL if no regimen data are available for the patient/lot; otherwise 0 indicates explicit observation with no identified regimen.\n- De‑duplication: counts distinct regimen identifiers (e.g., regimen code or canonical regimen name), so repeat records of the same regimen are counted once.\n- Examples: 0 (no regimen found), 1 (single regimen), 3 (three different regimens observed)."
        },
        {
          "column_name": "UNIQ_PRODUCT_COUNT",
          "data_type": "LONG",
          "description": "Concise business description\n\n- Meaning: The number of distinct products associated with the patient_lot record. In other words, how many unique product SKUs/drug codes/items were linked to that patient’s lot/episode (deduplicated by the product identifier used in the system, e.g., product_id, NDC or SKU).\n- Purpose: Measures product diversity per patient lot for reporting and analysis (e.g., adherence, dispensing complexity, billing).\n- Expected format/constraints:\n  - Data type: integer (LONG).\n  - Values: non‑negative whole numbers (0, 1, 2, …). 0 if no products found for the lot; NULL only if unknown/missing.\n  - No decimals or negative values.\n- Notes/assumptions: Uniqueness is determined by the product identifier in the claims data (specify which identifier in implementation). Ensure consistent deduplication rules (e.g., ignore quantity or duplicate line items) when populating this column."
        },
        {
          "column_name": "AVG_DAYS_SUPPLY_UPD",
          "data_type": "DOUBLE",
          "description": "Business description\n- Meaning: Average number of days’ medication supply per prescription associated with this patient lot, calculated from the updated/processed claims records. (The suffix _UPD indicates the value is derived from the “updated” claim data.)\n- Use: Used to understand typical supply duration per fill for the lot (adherence analysis, utilization reporting, inventory planning).\n\nExpected format and constraints\n- Data type: DOUBLE (numeric, can include fractional days).\n- Units: days.\n- Typical values: positive numbers (commonly in the range 1–365). Zero or NULL indicates no valid supply data for the lot.\n- Precision: stored as a floating point value; commonly shown with 1–2 decimal places (e.g., 30.00, 14.50).\n- Computation: arithmetic mean of the DAYS_SUPPLY_UPD values for all relevant fills in the lot (sum of days supply ÷ count of fills)."
        },
        {
          "column_name": "NO_OF_UNIQ_MONTHS",
          "data_type": "LONG",
          "description": "Meaning\n- The number of distinct calendar months in which the patient had claims within this patient_lot record. This counts distinct year+month combinations (for example, 2024-01 and 2025-01 are different), not days or claim counts.\n\nExpected format / rules\n- Data type: numeric integer (LONG).\n- Allowed values: 0 or positive whole numbers (0 means no claims in the period or no claim dates recorded). Null only if the source data is missing.\n- Granularity: counts unique Year-Month (YYYY-MM) values derived from claim date(s).\n\nExample\n- If a patient has claims dated 2023-11-15, 2023-11-28 and 2023-12-05 → NO_OF_UNIQ_MONTHS = 2.\n\nCalculation hint (example SQL)\n- COUNT(DISTINCT DATE_TRUNC('month', claim_date)) or COUNT(DISTINCT TO_CHAR(claim_date, 'YYYY-MM'))."
        },
        {
          "column_name": "MOST_USED_PROD",
          "data_type": "STRING",
          "description": "Meaning\n- MOST_USED_PROD is the single product (drug, device, or billed item) most frequently used by the patient lot for the summarization period. It identifies which product had the highest usage count/volume for that patient group.\n\nExpected format\n- A string containing either a standardized product identifier or a normalized product name. Preferred formats (in order):\n  1. Standard code (recommended): RxNorm ID, NDC, GPI, or the internal product_id (e.g., \"RXNORM:198440\", \"NDC:12345-6789-01\", \"INT_PROD_000123\").\n  2. Normalized product name if no code available: uppercase, human-readable name (e.g., \"ATORVASTATIN 20 MG TAB\").\n- If multiple products tie, the system should store the chosen tie-breaker (e.g., highest total quantity or most recent use); document the tie rule elsewhere.\n- Missing/unknown values should be NULL (or \"UNKNOWN\" only if NULLs are not permitted).\n\nExamples\n- \"RXNORM:198440\"\n- \"NDC:12345-6789-01\"\n- \"INSULIN GLARGINE 100U/ML\"\n- \"INT_PROD_000123\"\n\nNotes\n- Keep values consistent and preferably coded to enable grouping/joins. Limit length to typical VARCHAR(255) unless otherwise specified."
        },
        {
          "column_name": "MOST_USED_PROD_COUNT",
          "data_type": "LONG",
          "description": "Business description\n- Meaning: The total number of occurrences (claims, fills, administrations or other usage events) for the single product that was used most frequently by the patient within the given patient_lot summary. In other words, this is the frequency count of the most‑used product for that patient/lot during the summary period.\n\nExpected format and rules\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, …). 0 indicates no recorded product usage in the summary period/lot.\n- Nulls: NULL may be used when no summary was computed or source data are missing.\n- Tie handling: if two or more products share the top frequency, this field contains the highest count value (the shared frequency), not a product identifier.\n- Typical usage: combined with a product identifier column (e.g., MOST_USED_PROD_ID) to identify which product the count refers to; used for ranking, segmentation, and usage‑pattern analysis.\n\nExample values: 0, 1, 5, 27."
        },
        {
          "column_name": "IS_NEW",
          "data_type": "INT",
          "description": "Description\n- IS_NEW is a boolean indicator (stored as an INT) that signals whether this patient_lot record is newly created/introduced in the current ingestion or processing cycle.\n\nExpected format and values\n- Data type: INT used as a flag.\n- Permitted values:\n  - 1 = record is new\n  - 0 = record is not new (existing)\n  - NULL = unknown / not set (if applicable)\n- Best practice: constrain to 0/1 and treat as a boolean in queries/reports (e.g., WHERE IS_NEW = 1 to select newly created lots). Recommended default: 0."
        }
      ]
    }
  }
]