[
  {
    "catalog": "intelliegencedatacatalog",
    "schema": "claims_info",
    "table": {
      "table_name": "gold_patient_provider",
      "table_description": "What this table is\n- This table captures consolidated claims-level relationships between individual patients and the providers who treated them. It’s designed to give a clear, business-ready view of patient-provider activity, combining basic patient demographics, provider identifiers and specialties, geography, utilization metrics, and simple prescribing/product measures for each patient–provider pair.\n\nHigh-level business uses\n- Analyze patient engagement with specific providers (volume and recency of care).\n- Understand provider-level prescribing patterns and product penetration among their patients.\n- Segment patients and providers by geography, specialty, or utilization for targeting, outreach, or network optimization.\n- Support sales and marketing (product adoption, most/least prescribed), care-management, and provider performance or population-health analytics.\n- Feed into risk stratification, referral analysis, and contracting decisions.\n\nWhat the columns represent (plain language)\n- PATIENT_ID: Unique identifier for the patient (typically de-identified).\n- PAT_AGE: Patient’s age.\n- GENDER_DESC: Patient gender description.\n- PROVIDER_ID: Internal identifier for the provider.\n- NPI: Provider’s National Provider Identifier (standard external ID).\n- PRI_SPECIALTY_DESC: Provider’s primary specialty description.\n- SEC_SPECIALTY_DESC: Provider’s secondary specialty (if applicable).\n- ZIPCODE: Patient or provider ZIP code (clarify in metadata which one if needed).\n- STATE_CD: State code.\n- STATE_DESC: State name/description.\n- No_of_Claims: Total number of claims recorded between this patient and this provider.\n- FIRST_SERVICE_DATE: Date of the earliest recorded service for this patient-provider pair.\n- LATEST_SERVICE_DATE: Date of the most recent recorded service for this patient-provider pair.\n- COUNT_MONTHS: Number of distinct months during which this patient had services with this provider (a measure of continuity or spread).\n- MOST_PRES_PRODUCT: The product (drug/device) most frequently prescribed by this provider for this patient.\n- IS_LATEST_LOT_FLAG: Indicator flag showing whether this record reflects the latest data load/lot.\n- LEAST_PRESCRIBED_PRODUCT: The product least frequently prescribed by this provider for this patient (among tracked products).\n- LEAST_PRESCRIBED_REGIMEN: The least frequently used regimen (combination/treatment pattern) for this patient-provider pair.\n\nImportant notes and caveats\n- Confirm whether PATIENT_ID is de-identified and whether any columns contain PHI before using for outreach or research—observe HIPAA and internal privacy policies.\n- Definitions (for example, how “most prescribed” is determined or whether ZIPCODE is patient or provider) should be verified in the dataset’s technical metadata.\n- IS_LATEST_LOT_FLAG helps identify the newest records when data is refreshed; use it for time-sensitive analyses.\n\nIf you’d like, I can: (a) convert this into a one-paragraph elevator pitch for stakeholders, (b) create sample queries that illustrate common analyses, or (c) draft recommended data-quality checks for this table.",
      "columns": [
        {
          "column_name": "PATIENT_ID",
          "data_type": "STRING",
          "description": "- Business meaning: A stable, internal identifier that uniquely represents a patient within the claims dataset. It is used to link a patient’s records across rows and related tables (e.g., claims, encounters, enrollment) without exposing direct personal identifiers.\n\n- Expected format: A de‑identified alphanumeric string (tokenized or hashed). Common forms include opaque tokens or UUIDs (for example \"a1b2c3d4-...\") or project-specific codes like \"PAT123456\". There should be no embedded PII (names, SSNs, birthdates) or semantic meaning.\n\n- Data properties and usage: Treated as the primary patient key for joins and grouping; values should be unique per real patient and stable over time (not recycled). May be non-null for indexed/linked records; handle missing values according to dataset rules.\n\n- Privacy note: This column is a de‑identified key and must be handled per data governance and access controls; do not attempt to re-identify patients from this value."
        },
        {
          "column_name": "PAT_AGE",
          "data_type": "STRING",
          "description": "Column name: PAT_AGE\n\nBusiness description:\n- The patient’s age at the time of the claim/service, expressed in years.\n- Stored as a STRING in the source table but represents a numeric age value for the patient.\n\nExpected format and rules:\n- Primary format: whole number of years encoded as a string (e.g., \"0\", \"1\", \"25\", \"78\").\n- Range: non‑negative integers; typical logical range 0–120 (adjust per business rules). Values >120 are suspect and should be reviewed.\n- Special/censored values that may appear: common placeholders such as \"UNK\", \"NA\", empty string, or a capped value like \"90+\"; these should be normalized before numeric use.\n- For infants where age in months is required, systems sometimes encode \"0\" for <1 year — check source documentation if months are needed.\n- For analytics, convert to integer where possible, map known special codes to NULL or flagged categories, and handle censored values (e.g., \"90+\") according to privacy policies.\n\nExamples:\n- Valid: \"45\", \"0\", \"89\"\n- Special: \"UNK\", \"\", \"90+\" (treat as NULL or 90 depending on policy)"
        },
        {
          "column_name": "GENDER_DESC",
          "data_type": "STRING",
          "description": "Business description — GENDER_DESC (STRING)\n\n- Meaning: Human-readable gender/sex reported for the patient associated with the claim. It captures the patient’s gender indicator as recorded by the provider or payer (not a unique identifier).\n- Expected content/format:\n  - A single short string value per row (preferably trimmed, title case).\n  - Typical values: \"Male\", \"Female\", \"Other\", \"Unknown\" / \"Not Recorded\", \"Declined\" / \"Prefer not to answer\". Systems may also use single-letter codes (\"M\", \"F\", \"O\", \"U\", \"D\") or other site-specific labels.\n  - Maximum length: short (generally <= 50 characters). Avoid free‑text phrases; prefer standardized values.\n- Business use: patient segmentation, reporting, risk adjustment and compliance. For analytics, normalize incoming variants to a standardized set (e.g., Male/Female/Other/Unknown/Declined) before aggregation."
        },
        {
          "column_name": "PROVIDER_ID",
          "data_type": "STRING",
          "description": "Meaning\n- PROVIDER_ID is the unique identifier for the healthcare provider associated with the patient/claim record in intelliegencedatacatalog.claims_info.gold_patient_provider. It is used as the join/key to the provider master record (credentials, specialty, organization) and to link claims, billing, attribution, and reporting to a specific provider.\n\nExpected format\n- Data type: STRING (opaque identifier).\n- Typical forms you may encounter:\n  - National Provider Identifier (NPI): 10 numeric digits, e.g. \"1234567890\" (common in U.S. datasets).\n  - Internal provider IDs: alphanumeric codes, e.g. \"PROV_000123\" or \"P-00123\".\n- Rules/validation guidance:\n  - Treat as an opaque key — do not attempt to parse semantic meaning from the characters unless you know the source schema.\n  - Preserve leading zeros and case (or normalize to uppercase if your processes require consistency).\n  - Trim surrounding whitespace; expect no embedded spaces in a canonical ID.\n  - If your systems require NPI-specific logic, validate by checking for exactly 10 digits; otherwise allow alphanumeric.\n\nNotes\n- PROVIDER_ID should be unique per provider and stable over time; use it to join to provider dimension tables rather than using provider name or specialty fields."
        },
        {
          "column_name": "NPI",
          "data_type": "STRING",
          "description": "Column name: NPI\n\nBusiness definition:\n- The National Provider Identifier (NPI) assigned to the healthcare provider (individual or organization) associated with the claim. It uniquely identifies the provider for billing, reporting, provider matching, and analytics.\n\nExpected format:\n- A 10-digit numeric string (digits only). Example: 1234567893\n- No letters, punctuation, spaces, or dashes. Leading zeros are significant and must be preserved.\n- If present, should conform to NPI rules (10 digits; optionally validated with the NPI/Luhn check). If no valid NPI exists for a provider, the field should be NULL/empty.\n\nCommon validation checks:\n- Length = 10\n- Characters = digits 0–9 only\n- Optionally validate against CMS NPI registry or perform Luhn-based checksum verification for data quality."
        },
        {
          "column_name": "PRI_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Definition\n- The primary clinical specialty of the billing or servicing provider associated with the claim. It is a human-readable description of the provider’s main area of practice (e.g., the specialty recorded on enrollment, NPI registry, or claim).\n\nExpected format\n- STRING containing a single specialty name (short phrase), e.g., \"Family Medicine\", \"Internal Medicine\", \"Cardiology\".\n- Typically Title Case, plain text, no embedded codes. Length usually fits within standard text fields (commonly ≤255 characters).\n- May contain common variants (e.g., \"Family Practice\" vs \"Family Medicine\") and occasional prefixes/suffixes (e.g., \"Pediatrics - Neonatal\").\n\nExamples\n- \"Internal Medicine\"\n- \"Family Medicine\"\n- \"Emergency Medicine\"\n- \"Psychiatry\"\n- \"Nurse Practitioner\"\n\nNotes / usage guidance\n- Values may be drawn from provider enrollment/NPI taxonomy or from the claim; duplicates and synonyms are possible — normalize when grouping or reporting.\n- Null/empty values are possible when provider specialty is not supplied.\n- If you need a standardized code set for analytics or lookups, join to a provider table that contains taxonomy codes or map these descriptions to a controlled vocabulary (NPI taxonomy)."
        },
        {
          "column_name": "SEC_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Column name: SEC_SPECIALTY_DESC (STRING)\n\nBusiness meaning:\n- The provider’s secondary clinical specialty as a human‑readable description — i.e., an additional specialty area beyond the provider’s primary specialty. It identifies what other type(s) of care the provider is qualified to deliver.\n\nExpected format and values:\n- Free‑text string containing the specialty name (examples: \"Cardiology\", \"Family Medicine\", \"Pediatrics\", \"Orthopedic Surgery\", \"Radiation Oncology\").\n- May contain compound or qualifying phrases (e.g., \"Internal Medicine – Geriatrics\", \"Pediatrics; Adolescent Medicine\") or multiple specialties separated by commas/semicolons.\n- Null/empty when no secondary specialty is recorded.\n- Typical casing is title case but not guaranteed; abbreviations (e.g., \"ENT\") or synonyms may appear.\n\nNotes for use and quality control:\n- Standardize to a controlled vocabulary or map to an external taxonomy (e.g., NPI taxonomy codes) for reliable analytics.\n- Trim whitespace, normalize delimiters, expand common abbreviations, and handle multiple specialties as separate values if needed."
        },
        {
          "column_name": "ZIPCODE",
          "data_type": "STRING",
          "description": "Column purpose\n- ZIPCODE contains the postal ZIP code associated with the patient/provider address on the claim (used for geolocation, regional reporting, payer/provider routing, etc.).\n\nExpected format and rules\n- Stored as a STRING to preserve leading zeros.\n- Valid expected patterns:\n  - 5-digit: \"12345\"\n  - ZIP+4: \"12345-6789\" (preferred) or sometimes \"123456789\"\n- Recommended validation: matches the regex ^\\d{5}(-\\d{4})?$ (or accept 9 contiguous digits as an alternative), no letters or other punctuation, trim whitespace.\n- Nulls/unknowns: field may be NULL or contain a standardized token such as \"UNKNOWN\" when ZIP is not available.\n- Data quality notes: exclude placeholder values like \"00000\" or obviously invalid codes; if non‑U.S. postal codes are present, document them separately (this column is intended for U.S. ZIP codes)."
        },
        {
          "column_name": "STATE_CD",
          "data_type": "STRING",
          "description": "Business description:\n- STATE_CD records the two-letter U.S. state/territory code for the entity’s location (i.e., the state associated with the patient/provider record).\n- Expected format: 2-character uppercase USPS postal abbreviation (alphabetic), e.g. CA, NY, TX.\n- Allowed values: the 50 U.S. states plus DC and common U.S. territories (PR, GU, VI, AS, MP); use NULL/empty when unknown.\n- Data quality rules: exactly 2 letters, no leading/trailing whitespace or punctuation. If full state names or FIPS/ISO codes are submitted, map/convert them to the USPS two-letter code."
        },
        {
          "column_name": "STATE_DESC",
          "data_type": "STRING",
          "description": "- Business meaning: The STATE_DESC column identifies the U.S. state, district, or territory associated with the patient or provider record (typically the state of residence, practice location, or billing address as captured on the claim).\n\n- Expected format: a text value naming the state. Best practice is to store a standardized code (preferred) or the full state name:\n  - Preferred: USPS two‑letter uppercase postal code (e.g., CA, NY, TX).\n  - Acceptable alternative: full state name in Title Case (e.g., California, New York, Texas).\n\n- Examples: CA, NY, TX (preferred) or California, New York, Texas.\n\n- Validation/edge cases: allow District of Columbia (DC) and U.S. territories (PR, VI, GU, MP, AS) or their full names; represent unknown/missing explicitly (NULL or a standard marker such as \"Unknown\"); avoid free‑form text, typos, or non‑U.S. locations unless those are expected for the dataset."
        },
        {
          "column_name": "No_of_Claims",
          "data_type": "LONG",
          "description": "Column name: No_of_Claims\n\nBusiness description:\n- The No_of_Claims field is a count of claims associated with the patient–provider record (i.e., how many claims the patient submitted/received from that provider) within the dataset’s measurement window or the system’s defined reporting period.\n- It represents whole claims (typically counted by unique claim identifiers), not claim line-items, dollar amounts or partial claims. Use it to measure utilization, provider workload, or patient continuity with a provider.\n\nExpected format and rules:\n- Data type: LONG (integer).\n- Allowed values: 0, 1, 2, ... (non‑negative whole numbers). No decimals or negative values.\n- Nulls: null indicates missing/unknown claim-count for that patient–provider pair; downstream logic should handle null separately from 0 (zero = confirmed no claims).\n- Typical validations: verify values are >= 0, within a plausible range for the reporting period, and consistent with counts of unique claim IDs in the source. Document the reporting window used to generate the count."
        },
        {
          "column_name": "FIRST_SERVICE_DATE",
          "data_type": "STRING",
          "description": "Business meaning\n- The FIRST_SERVICE_DATE is the date of the earliest recorded clinical/service encounter between the patient and the provider represented by the record (i.e., the first claim/visit date for that patient–provider pair within the dataset/time window).\n\nExpected format and rules\n- Stored as a STRING; expected canonical format is ISO 8601 date: YYYY-MM-DD (e.g., 2020-01-15).\n- Missing or unknown values should be NULL or an empty string.\n- Values must be valid calendar dates; dates outside the study/enrollment period should be treated as data-quality exceptions.\n- When parsing, convert to a date datatype for comparisons, sorting, and interval calculations."
        },
        {
          "column_name": "LATEST_SERVICE_DATE",
          "data_type": "STRING",
          "description": "Concise business description\n- LATEST_SERVICE_DATE is the most recent date-of-service recorded on claims for the patient–provider relationship represented by the row. It indicates the most recent clinical/service event (DOS) from the claims feed, not the claim submission or adjudication date.\n\nExpected format and values\n- Stored as a STRING but should be represented as an ISO date: YYYY-MM-DD (e.g., 2023-08-15).\n- Allowed: a valid calendar date ≤ today, or NULL/empty if no service date is available.\n- Should not contain time or timezone components; if a timestamp exists, it should be normalized to the date portion.\n\nData-quality notes (brief)\n- Ensure values are parseable to a date and normalized to ISO format.\n- Be aware this field reflects claims data and may be updated if later claims with later DOS are ingested."
        },
        {
          "column_name": "COUNT_MONTHS",
          "data_type": "LONG",
          "description": "Concise business description\n- COUNT_MONTHS is the number of distinct calendar months (year-month periods) during the observation window in which the patient had at least one claim recorded with the given provider.\n\nDefinition / calculation\n- For a given patient–provider pair, COUNT_MONTHS = count of unique year-month values from claim service dates where patient_id and provider_id match.\n- Multiple claims in the same month count once; claims on different days within the same month are not double-counted.\n\nExpected format and datatype\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, …). No fractional values.\n\nTypical range and examples\n- If the observation window is 12 months, typical values will be 0–12. If the dataset uses a longer/all-time window, the upper bound can be larger.\n- Example: COUNT_MONTHS = 3 means the patient had claims with that provider in three distinct months (e.g., 2024-01, 2024-03, 2024-04).\n\nNotes / edge cases\n- 0 indicates no claims for that patient–provider pair in the observation window (or the pair is present with no linked claims).\n- Null may indicate missing data or that the count was not computed; prefer 0 to represent no claims when appropriate.\n- Use for continuity/engagement metrics (e.g., identifying frequent providers or continuity of care)."
        },
        {
          "column_name": "MOST_PRES_PRODUCT",
          "data_type": "STRING",
          "description": "Meaning\n- The single medication/product most frequently prescribed to the patient by the given provider during the measurement period (i.e., the product with the highest count or volume of prescriptions for that patient‑provider pair).\n\nExpected format\n- STRING containing a human‑readable product name, typically including drug name and optionally strength and dosage form (examples: \"Lisinopril 10 mg tablet\", \"Atorvastatin 20 mg tab\").\n- In datasets using standard coding, this field may instead contain or append a standard identifier (e.g., RxNorm concept ID or NDC) or a combined value (e.g., \"Metformin 500 mg tablet | RxNorm:123456\").\n- Null/empty when no prescriptions exist for the patient‑provider pair.\n\nNotes\n- One value per patient‑provider record; if multiple products tie for top frequency, the system returns the single product selected by the business logic (e.g., highest quantity or most recent)."
        },
        {
          "column_name": "IS_LATEST_LOT_FLAG",
          "data_type": "INT",
          "description": "Meaning\n- Indicates whether this row belongs to the most recent ingestion/processing \"lot\" (batch) for the patient–provider record set. It marks which records should be treated as the current/latest copy.\n\nExpected format and values\n- Data type: INT.\n- Values: 1 = is the latest lot; 0 = is not the latest lot.\n- NULLs (if present) should be treated as unknown/false unless your ETL defines otherwise.\n\nBusiness usage\n- Use IS_LATEST_LOT_FLAG = 1 to select the current/latest records for reporting or downstream processing.\n- The flag is set during ETL when lots are ingested and reconciled; it is not a timestamp or version number."
        },
        {
          "column_name": "LEAST_PRESCRIBED_PRODUCT",
          "data_type": "STRING",
          "description": "Definition\n- The drug product (medication) that was prescribed the fewest times for the given patient–provider pair during the measurement window represented by the record.\n\nExpected contents / format\n- A single string representing the product name (e.g., \"atorvastatin 20 mg oral tablet\", \"metformin XR 500 mg tablet\", or a brand name such as \"Lipitor 10 mg tablet\").\n- Common encodings: generic name ± strength ± route/form. Values may also contain brand names when brand was prescribed.\n- Null/empty if no prescriptions exist for the patient–provider pair in the interval.\n- Possible sentinel values: \"UNKNOWN\", \"MULTIPLE\" or similar when a least-prescribed product cannot be determined or multiple products tie (dataset-specific; check data dictionary).\n\nExamples\n- \"lisinopril 10 mg tablet\"\n- \"amoxicillin 500 mg capsule\"\n- NULL\n\nBusiness notes / recommendations\n- Intended use: identify the single lowest-frequency medication prescribed by that provider to that patient for analytical purposes (adherence, prescribing patterns, cost analyses).\n- Because the column is free-text, standardize to a coded vocabulary (RxNorm or NDC) where possible to avoid ambiguity and improve joinability and analytics.\n- If ties are possible, confirm tie-breaking logic (alphabetical, first-occurrence, or flagged) in upstream processing."
        },
        {
          "column_name": "LEAST_PRESCRIBED_REGIMEN",
          "data_type": "STRING",
          "description": "Definition\n- The regimen (treatment protocol/drug combination) that was prescribed the least often by this provider for the given patient during the measurement period.\n\nBusiness purpose\n- Used in provider- or patient-level prescribing analyses to identify infrequently used treatment regimens, outlier behaviour, or to populate summary reports.\n\nExpected format\n- A single text label or code identifying the regimen. Prefer standardized names or codes when available (e.g., internal regimen name, RxNorm/RxCUI, or an internal regimen ID).\n- If expressed as drug names, list drugs separated by \" + \" and optionally include dosage/strength in parentheses. Examples:\n  - FOLFOX\n  - Lisinopril 10 mg\n  - DrugA + DrugB (50 mg)\n  - RXCUI:123456\n- Null/empty if no prescriptions exist for the patient-provider pair during the period. If multiple regimens tie for the lowest count, the ETL may return one representative regimen or a delimited list (check upstream specification).\n\nNotes\n- Keep value length within typical string limits (e.g., <= 256 chars) and use consistent naming/coding to support aggregation and joins."
        }
      ]
    }
  },
  {
    "catalog": "intelliegencedatacatalog",
    "schema": "claims_info",
    "table": {
      "table_name": "silver_patient_provider",
      "table_description": "Summary\nThis table is a curated patient–provider level dataset that captures clinical and claims activity linking individual patients to the providers who treated them. It is designed for business users and analysts to understand utilization, prescribing patterns, and provider relationships over time at a patient-level (typically de-identified). The table lives in the “silver” layer of the data catalog, meaning records are cleaned and integrated but still suitable for analytical use rather than raw ingestion.\n\nWhat the table contains (column-by-column)\n- PATIENT_ID: Unique identifier for the patient (usually de‑identified). Use to track a patient across claims while protecting direct identifiers.\n- PAT_AGE: Patient age (at time of care or claim). Useful for age‑band analyses and cohorting.\n- GENDER_DESC: Patient gender description (e.g., Male, Female, Other/Unknown).\n- PROVIDER_ID: Internal identifier for the treating provider or organization.\n- NPI: National Provider Identifier (standard external identifier for the provider).\n- PRI_SPECIALTY_DESC: Provider’s primary specialty description (e.g., Cardiology, Family Medicine).\n- SEC_SPECIALTY_DESC: Provider’s secondary specialty (if available).\n- ZIPCODE: Patient or service ZIP code (depending on sourcing), useful for geographic analysis at a local level.\n- STATE_CD: State code (abbreviation).\n- STATE_DESC: Full state name.\n- No_of_Claims: Count of claims attributed to this patient–provider pair over the measured period.\n- FIRST_SERVICE_DATE: Date of the earliest recorded service or claim for this patient–provider pair.\n- LATEST_SERVICE_DATE: Date of the most recent recorded service or claim for this patient–provider pair.\n- COUNT_MONTHS: Number of months between first and latest service (or the count of unique months with activity).\n- MOST_PRES_PRODUCT: The product (drug or item) most prescribed for this patient by this provider (if prescription data included).\n- IS_LATEST_LOT_FLAG: Indicator flag marking whether this row represents the most recent lot/record for a given patient–provider combination (useful for deduplication or selecting current-state records).\n\nPrimary business uses\n- Provider network analysis and attribution (who is treating which patients and how often).\n- Utilization and trend analysis (claims volume, visit frequency, and months active).\n- Prescribing and product usage insights (identify most frequently prescribed products by provider or patient cohort).\n- Patient cohorting for outreach, care management, or quality programs by age, geography, provider specialty, or activity period.\n- Geo- and specialty-based performance or risk stratification for population health initiatives.\n\nPractical notes and governance\n- The table may contain sensitive health-related information; handle per privacy and regulatory policies (HIPAA, internal access control). PATIENT_ID should be treated as sensitive if it can be re-identified.\n- Confirm whether ZIPCODE is patient residence or service location before using for market analyses.\n- FIRST_SERVICE_DATE and LATEST_SERVICE_DATE can be used to measure patient retention or recency; COUNT_MONTHS clarifies time span.\n- Validate MOST_PRES_PRODUCT and IS_LATEST_LOT_FLAG definitions with the data owner for correct interpretation (e.g., tie‑breaking rules, lot semantics).\n\nIf you’d like, I can: (a) create example queries to answer common business questions, (b) suggest data quality checks to run on this table, or (c) map these fields to common metrics (e.g., active patients per provider, average claims per month).",
      "columns": [
        {
          "column_name": "PATIENT_ID",
          "data_type": "STRING",
          "description": "Business description\n- PATIENT_ID is the stable, system-level identifier that represents a single patient across the claims and provider data in this silver-level table. It is the primary key (or join key) used to link a patient’s records across rows and related patient/provider tables.\n\nExpected format and rules\n- Data type: string (text).\n- Uniqueness/stability: non-null and unique per patient within the dataset; the same PATIENT_ID must persist for the same patient across time and tables.\n- De-identification: should not contain direct PHI (no names, SSNs, birthdates); typically a pseudonymized or hashed identifier.\n- Character set: alphanumeric; may include hyphens or underscores if UUIDs or hashed tokens are used. No whitespace.\n- Typical examples: a UUID (e.g., a3f47e9b-12c4-4d2f-8a7b-0e1f2c3d4b5e) or a hashed token (e.g., 8–32 hex characters).\n- Case sensitivity: treat as case-sensitive unless system rules state otherwise.\n\nUsage note\n- Use PATIENT_ID for joins to patient-level tables and to de-duplicate or aggregate patient records."
        },
        {
          "column_name": "PAT_AGE",
          "data_type": "STRING",
          "description": "Business description:\n- PAT_AGE is the patient’s age at the time of the claim/event.\n- Stored as a string; the value represents age in years (the unit is years).\n- Expected formats are numeric strings (e.g., \"45\", \"0\") and may include decimals for fractional years (e.g., \"0.5\") or occasional notations such as \"<1\". Missing or unknown values may appear as NULL or categorical markers like \"UNK\"/\"NA\".\n- For analysis, convert to a numeric field (and standardize how \"<1\" or other non‑numeric markers are handled) so all ages are expressed consistently in years."
        },
        {
          "column_name": "GENDER_DESC",
          "data_type": "STRING",
          "description": "Business definition\n- GENDER_DESC is the human-readable gender/sex label recorded on the claim for the individual (patient or provider) associated with the record. It describes how the gender was reported in source data rather than deriving identity or clinical sex.\n\nExpected format and values\n- Data type: STRING. Short descriptive values (not codes).\n- Normalized/expected values (recommended canonical set):\n  - \"Male\"\n  - \"Female\"\n  - \"Other\" (includes non-binary / third-gender responses)\n  - \"Unknown\" / \"Not recorded\" / \"Not specified\"\n- Source variants that should be mapped to the canonical set:\n  - \"M\" → \"Male\", \"F\" → \"Female\"\n  - \"UNK\", \"U\", blank, NULL → \"Unknown\"\n  - \"Non-Binary\", \"NB\", \"Third Gender\", etc. → \"Other\"\n- Values should be trimmed and title-cased when stored (e.g., \"male\" → \"Male\").\n\nNotes and usage\n- Use for demographic reporting, cohort selection, and analytics. Treat as sensitive personal data and follow privacy/compliance rules.\n- If the table mixes patient and provider roles, context (patient vs provider) should be taken from role fields; do not infer role from GENDER_DESC."
        },
        {
          "column_name": "PROVIDER_ID",
          "data_type": "STRING",
          "description": "Meaning\n- Logical identifier for the healthcare provider associated with the patient/claim record. It identifies the individual or organization that delivered care (e.g., physician, facility, group).\n\nExpected format\n- Stored as a STRING to accommodate different identifier systems.\n- Common values:\n  - National Provider Identifier (NPI): 10-digit numeric string (e.g., 1234567890).\n  - Internal or legacy IDs: alphanumeric strings, often with prefixes (e.g., PROV-000123).\n  - Taxonomy or specialty codes when used as supplemental identifiers.\n- Preserve any leading zeros and non-numeric characters (hence string type).\n\nBusiness rules / notes\n- Acts as the stable key linking to provider master/profile records; the same PROVIDER_ID should reference the same provider across tables.\n- Validate against the expected source system (NPI registry or internal provider master). If NPI is expected, enforce a 10-digit numeric format. If multiple identifier systems are used, include an accompanying identifier_type field."
        },
        {
          "column_name": "NPI",
          "data_type": "STRING",
          "description": "Business description\n- NPI (National Provider Identifier) — the CMS-issued unique identifier for a healthcare provider (individual or organization) used to link claims, providers, and billing records.\n\nExpected format and validation\n- Stored as a STRING containing exactly 10 numeric digits (no letters, spaces, dashes or punctuation).\n- Example: \"1234567890\"\n- Allowed values: valid 10-digit NPI or NULL/empty when no NPI is available.\n- Recommended checks: trim whitespace, strip non-digits, enforce length = 10, and optionally validate against an NPI registry if stricter verification is required.\n\nTypical uses\n- Join/lookup to provider master tables, taxonomy, payer files, and claims adjudication."
        },
        {
          "column_name": "PRI_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Business description\n- PRI_SPECIALTY_DESC is the provider’s primary specialty or specialty description associated with the patient claim/provider record. It identifies the clinical area or role the provider practices in (e.g., cardiology, family medicine, nurse practitioner).\n\nExpected format and usage\n- Type: free‑text string (source descriptive label).  \n- Typical length: short phrase (commonly under 100 characters; stored up to typical string limits, e.g., 255 chars).  \n- Content: human‑readable specialty names or role descriptions (examples: \"Cardiology\", \"Family Medicine\", \"Internal Medicine\", \"Pediatrics\", \"Emergency Medicine\", \"Nurse Practitioner\", \"Physician Assistant\", \"Psychiatry\"). May include modifiers (e.g., \"Cardiology - Interventional\", \"Family Medicine/OB\").  \n- Occurrence: one value per provider entry on the claim; may be null or missing when not supplied by the source.  \n- Notes for analysts: values are descriptive and not a standardized code set—expect variations, abbreviations and combined entries. For reliable reporting or grouping, map these descriptions to a controlled taxonomy (e.g., NUCC/CMS provider taxonomy or internal specialty codes), trim whitespace, and normalize casing/punctuation."
        },
        {
          "column_name": "SEC_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Business description\n- Meaning: Human-readable description of the provider’s secondary medical specialty. This field explains the clinical area (or sub‑specialty) in which the provider practices in addition to — or instead of — their primary specialty.\n\nExpected format and rules\n- Type: Free‑text string (display name of the specialty).\n- Typical content: Single specialty name (e.g., \"Cardiology\", \"Family Medicine\", \"Pediatrics\", \"Orthopedic Surgery — Sports Medicine\").\n- Optional/blank: May be NULL or empty when no secondary specialty is recorded.\n- Normalization guidance: Prefer use of a controlled vocabulary (CMS/NUCC taxonomy description or an internal master list). Trim leading/trailing whitespace; use consistent capitalization; avoid embedded codes. If multiple secondary specialties are present, store them as separate rows or use a defined delimiter (e.g., semicolon) and document the delimiter.\n- Validation: length limit (e.g., <=255 chars), not purely numeric, and should map to an approved specialty list where possible.\n\nExample values\n- \"Internal Medicine\"\n- \"Family Medicine\"\n- \"Geriatric Medicine\"\n- \"Cardiothoracic Surgery; Transplant Surgery\" (if multiple, only if delimiter convention is documented)"
        },
        {
          "column_name": "ZIPCODE",
          "data_type": "STRING",
          "description": "Business description\n- Meaning: Postal ZIP code associated with the patient/provider in this record — used to identify geographic location for analysis, routing, or matching to external demographic/geographic datasets.\n- Data type/why string: Stored as STRING to preserve leading zeros and non-numeric characters (e.g., hyphen in ZIP+4).\n\nExpected format and examples\n- Primary formats: 5-digit US ZIP (e.g., \"02115\") or ZIP+4 (9 digits with optional hyphen, e.g., \"02115-1234\" or \"021151234\").\n- Normalization guidance: trim whitespace, preserve leading zeros, allow optional hyphen for ZIP+4; preferred canonical form is 5-digit or 5-digit + \"-\" + 4-digit.\n- Validation: valid values consist of 5 numeric digits or 5+4 digits (with or without hyphen). Use NULL/empty for missing or use a designated code (do not use invalid placeholders like \"00000\").\n\nNotes\n- If dataset includes non‑US addresses, consider using a separate country/postal_code field or document non‑US postal formats explicitly."
        },
        {
          "column_name": "STATE_CD",
          "data_type": "STRING",
          "description": "Business description\n- STATE_CD is the two‑character U.S. state or territory postal code that identifies the state associated with the patient/provider record (typically the patient’s residence or the provider’s practice location as defined in the table’s metadata).\n\nExpected format and values\n- Two uppercase letters using the USPS postal abbreviation (e.g., NY, CA, TX, FL).  \n- Includes District of Columbia and territories where applicable (e.g., DC, PR, VI, GU, AS, MP).  \n- Stored as a string, trimmed with no punctuation or spaces.  \n- Allowable exceptions: NULL/blank when state is unknown or not collected; any non‑standard codes should be documented in the data dictionary."
        },
        {
          "column_name": "STATE_DESC",
          "data_type": "STRING",
          "description": "Business description\n- Meaning: The name of the U.S. state or territory associated with the patient or provider record (geographic jurisdiction for the address on this row).\n- Expected format: Full state/territory name as a string in normal title case (e.g., \"California\", \"New York\", \"District of Columbia\", \"Puerto Rico\"); no two‑letter USPS abbreviations, no leading/trailing whitespace. If the state is unknown or not applicable the field may be NULL or contain a defined sentinel (e.g., \"Unknown\").\n- Usage notes: Used for geographic filtering, aggregation and joins to reference/state-code tables; values should conform to a controlled list of the 50 states, DC and applicable U.S. territories for consistency."
        },
        {
          "column_name": "No_of_Claims",
          "data_type": "LONG",
          "description": "Meaning\n- Count of claims associated with the patient–provider pair represented by the row. This is an aggregated, business-level measure (e.g., number of submitted/processed claim records for that patient with that provider within the record’s scope/time window).\n\nExpected format and constraints\n- Data type: LONG (64-bit integer).  \n- Values: non‑negative whole numbers (0, 1, 2, …). No decimals.  \n- Nulls permitted only when no data is available for the pair.  \n- Typical validation: derived by counting distinct claim IDs; should not be negative and should reflect the table’s defined date/window and inclusion rules (e.g., whether canceled or duplicate claims are excluded).  \n\nExamples\n- 0 (no claims), 1, 23."
        },
        {
          "column_name": "FIRST_SERVICE_DATE",
          "data_type": "STRING",
          "description": "Meaning\n- The FIRST_SERVICE_DATE is the earliest clinical service date on file for the given patient–provider pair (i.e., the first date the provider rendered care to that patient as recorded in the claims data). It is used to determine the start of the patient–provider relationship or patient tenure with that provider. This is a service (treatment/encounter) date derived from claim lines, not a claim submission or adjudication date.\n\nExpected format\n- Stored as a string in ISO 8601 date format: YYYY-MM-DD (example: \"2020-01-15\"). No time or timezone component is included. If the exact service date is unknown, the field should be NULL or empty rather than an ambiguous/partial date."
        },
        {
          "column_name": "LATEST_SERVICE_DATE",
          "data_type": "STRING",
          "description": "Business description:\n- Meaning: The most recent date on which the patient received a billed service from the specified provider (the latest service date recorded in the claims for that patient‑provider pair).\n- Expected format & values: Stored as a string in ISO‑8601 date format (date only) \"YYYY-MM-DD\" (for example, \"2024-06-15\"). Empty or NULL indicates no recorded service date. Because the column is a STRING, cast/parse to a DATE type before performing date arithmetic."
        },
        {
          "column_name": "COUNT_MONTHS",
          "data_type": "LONG",
          "description": "Business description\n- COUNT_MONTHS is the number of calendar months during the measurement/observation period in which the patient had at least one claim tied to the specified provider. It represents the months of interaction/recorded activity (or months of coverage) between the patient and provider used for cohorting or utilization measures.\n\nExpected format and values\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (e.g., 0, 1, 2, …). Typical ranges are 0–12 for a 12‑month measurement window, but can exceed 12 if a longer period is used.\n- Null or missing may indicate the observation window is unknown or the relationship was not evaluated.\n\nNotes/assumptions\n- Months are counted as distinct calendar months (partial-month activity counts as one month). Duplicate claims within the same month should count once. For exact derivation rules (window start/end, claim date used), consult the project’s data dictionary or ETL specification."
        },
        {
          "column_name": "MOST_PRES_PRODUCT",
          "data_type": "STRING",
          "description": "Meaning\n- The product (typically a drug or other billable/prescribable medical product) that was prescribed most often by the given provider for the given patient during the measurement/observation period represented by the row.\n\nExpected format\n- STRING containing a single product identifier or name. Common formats seen or recommended:\n  - Human-readable product name, often including strength and form (e.g., \"Atorvastatin 20 MG Oral Tablet\", \"Metformin ER 500 mg Tablet\")\n  - Or a coded identifier with a prefix to indicate code system (recommended): e.g., \"RXNORM:104962\", \"NDC:00093-7529-05\"\n- Field holds one value per patient‑provider row; use NULL/empty when no prescription exists.\n- Values are expected to be normalized where possible (consistent naming or choice of code system) to support aggregation and analysis.\n\nNotes\n- If ties or ETL selection rules exist (e.g., choose most recent in a tie), those are set by upstream processing and are not implied by the field itself."
        },
        {
          "column_name": "IS_LATEST_LOT_FLAG",
          "data_type": "INT",
          "description": "Business description\n- IS_LATEST_LOT_FLAG indicates whether the row represents the most recent data \"lot\" (load/batch) for the patient–provider combination (i.e., the current/latest record to use for reporting or downstream processing).\n\nExpected format and values\n- Data type: INT\n- Allowed/expected values:\n  - 1 = this row is the latest lot (true/current)\n  - 0 = this row is not the latest lot (false/historical)\n  - NULL = unknown / not set (avoid for production use)\n- Usage: filter with WHERE IS_LATEST_LOT_FLAG = 1 to retrieve the current record(s). This flag does not encode effective dates or version timestamps; use lot_id/load_date fields (if available) for tie‑breaking or auditing."
        }
      ]
    }
  },
  {
    "catalog": "intelliegencedatacatalog",
    "schema": "claims_info",
    "table": {
      "table_name": "silver_provider",
      "table_description": "High-level summary\n- This table profiles individual prescribing providers and summarizes their prescribing activity for a therapeutic area or product set. It links a provider’s identity and specialty with geographic location and simple utilization metrics so business teams can compare, segment, and prioritize providers.\n\nWhat the table contains (column-by-column)\n- PROVIDER_ID: Internal identifier for the provider (used to join to other internal tables).\n- NPI: The provider’s National Provider Identifier (public identifier for clinicians).\n- PRI_SPECIALTY_DESC: The provider’s primary specialty (e.g., Oncology, Cardiology).\n- SEC_SPECIALTY_DESC: The provider’s secondary specialty, if any.\n- ZIPCODE: Provider practice ZIP code.\n- STATE_CD / STATE_DESC: Provider state code and full state name.\n- TOTAL_DIAGNOSED_PATIENTS: Count of unique patients diagnosed with the condition(s) of interest attributed to that provider (an aggregated patient volume metric).\n- UNIQ_LINES_CONTRIBUTING: Count of unique claim/line items contributing to the provider’s measured activity (a measure of prescribing/claim volume).\n- MOST_PRESCRIBED_PRODUCT: The single product (drug) the provider prescribes most frequently within the measured set.\n- LEAST_PRESCRIBED_PRODUCT: The product prescribed least frequently (among products observed for that provider).\n- MOST_PRESCRIBED_REGIMEN: The most commonly prescribed regimen (combination or defined treatment course) for that provider.\n- LEAST_PRESCRIBED_REGIMEN: The least commonly prescribed regimen observed for that provider.\n\nTypical business uses\n- Provider segmentation and prioritization for field/sales targeting (high diagnosed volume, high prescribing of target product).\n- Market share and competitive analysis at the provider or geography level.\n- Tactical planning for account management or promotional campaigns by specialty, ZIP, or state.\n- Identifying patterns of regimen use and opportunities for education or product positioning.\n- Cross-referencing with patient- or claims-level datasets for deeper analysis (e.g., conversion rates, persistence).\n\nPractical notes and caveats\n- Data is aggregated to provider-level counts; it does not contain individual patient records. NPI is a public identifier, but access should still be controlled because the table links providers to utilization metrics.\n- “Most/least prescribed” reflect the observed product/regimen within the measured population and time window; definitions depend on upstream ETL and should be confirmed (e.g., tie-breaking rules, look-back period).\n- Use governance controls for sharing (legal, compliance, and opt-out requirements may apply depending on jurisdiction).\n\nIf you want, I can:\n- Draft a one-page slide describing key insights derived from this table, or\n- Provide SQL examples for common queries (top providers by diagnosed patients, by state, by product).",
      "columns": [
        {
          "column_name": "PROVIDER_ID",
          "data_type": "STRING",
          "description": "Business description\n- Meaning: Unique identifier for the healthcare provider referenced on a claim. This value links claim rows to the provider master record and is used for joins, reporting and downstream aggregations (e.g., payer/provider analytics, network attribution).\n- Expected content: a stable, system-assigned provider ID (not personal data). Typical values are either a 10‑digit numeric NPI (National Provider Identifier) or an internal alphanumeric ID/UUID assigned by the source system. Do not use free-text names.\n- Format expectations / validation guidance:\n  - Data type: STRING (trim leading/trailing spaces).\n  - Allowed characters: digits [0-9] and letters [A‑Z a‑z]; optional hyphens for UUIDs. Prefer uppercase normalized values.\n  - Common patterns: 10-digit numeric (^\\d{10}$) for NPI, or UUID v4 (^[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}$) or an organization-specific alphanumeric ID.\n  - Uniqueness/stability: should uniquely identify a provider within the dataset and remain stable over time; changes to identifiers should be captured in a provider master table rather than replacing historical IDs.\n- Usage note: When ingesting from multiple source systems, prefix or map source IDs to a canonical provider key so the column can be reliably used for cross-system joins."
        },
        {
          "column_name": "NPI",
          "data_type": "STRING",
          "description": "Meaning:\n- NPI is the National Provider Identifier — the unique 10-digit identifier issued by CMS to U.S. healthcare providers (individuals and organizations). It is used to identify the billing or servicing provider in claims and provider directories.\n\nExpected format:\n- A 10-digit numeric string (digits 0–9). Store as string to preserve leading zeros.\n- No punctuation, spaces, or letters (e.g., \"1234567890\").\n- Null or empty when a provider does not have an NPI or it is not provided.\n\nNotes (optional):\n- Use this field to join to external NPI registries or provider master tables. Validate length and digit-only content; some implementations also verify the NPI check-digit."
        },
        {
          "column_name": "PRI_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Business meaning\n- Human-readable description of the provider’s primary medical or professional specialty used to classify providers on claims (e.g., for network, payment, utilization and reporting purposes).\n\nExpected contents and format\n- A short free-text specialty name, ideally drawn from a controlled list (NPI/Taxonomy or internal specialty master).  \n- Typical examples: \"Cardiology\", \"Family Medicine\", \"Internal Medicine\", \"Pediatrics\", \"Orthopaedics\", \"Radiology\", \"Psychiatry\", \"Emergency Medicine\".  \n- Prefer a single primary specialty. If multiple values are present they should be delimited consistently (e.g., \"Family Medicine / OB-GYN\") and then normalized during processing.  \n- Use a consistent casing and trimmed values (recommend title case or UPPERCASE), avoid trailing punctuation.  \n- Unknown or not recorded providers should be NULL or an explicit value such as \"UNKNOWN\" or \"UNSPECIFIED\" per organizational convention.\n\nBest practice\n- Map these strings to a canonical taxonomy code (NPI taxonomy or internal code set) for reliable aggregation and analytics."
        },
        {
          "column_name": "SEC_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Meaning\n- SEC_SPECIALTY_DESC contains the provider’s secondary specialty or sub‑specialty as a text description. It is used to identify an additional clinical area of practice for the provider beyond their primary specialty.\n\nExpected format\n- Human‑readable specialty name (string). Examples: \"Cardiology\", \"Pediatric Cardiology\", \"Family Medicine\", \"Emergency Medicine\", \"Diagnostic Radiology\".\n- Often a single phrase in title case; when multiple specialties are recorded they are typically separated by a comma or semicolon (e.g., \"Internal Medicine; Geriatrics\").\n- Field may be NULL/empty if no secondary specialty is recorded.\n- Not a coded field (no taxonomy codes); if codes are required use the dedicated taxonomy/code column if available.\n\nRecommended handling\n- Normalize by mapping to a canonical specialty list (e.g., CMS/NPI taxonomy) for reporting or joins.\n- Trim whitespace, treat values case‑insensitively, and handle common synonyms and misspellings."
        },
        {
          "column_name": "ZIPCODE",
          "data_type": "STRING",
          "description": "Business description:\n- Meaning: The ZIPCODE field records the provider’s postal code associated with the claim (typically the provider’s mailing or practice location at time of claim). It is used for geographic analysis, routing, regional reporting, and payer/provider segmentation.\n\nExpected format and validation:\n- Stored as a string; preserve leading zeros.\n- Preferred formats for U.S. addresses:\n  - 5-digit ZIP: \"NNNNN\" (e.g., \"02115\")\n  - ZIP+4: \"NNNNN-NNNN\" or \"NNNNNNNN\" (e.g., \"02115-1234\" or \"021151234\")\n- Allowed characters: digits, with an optional single hyphen between the 5th and 6th digit for ZIP+4.\n- Non-U.S. postal codes: may contain alphanumeric characters per local postal conventions; treat as valid but document country context.\n- Handle special/placeholder values (e.g., \"00000\", \"UNKNOWN\", null) explicitly in downstream logic.\n\nRecommendation:\n- Normalize to 5-digit for aggregated analysis and retain the raw value for address validation or mailing tasks."
        },
        {
          "column_name": "STATE_CD",
          "data_type": "STRING",
          "description": "Business description\n- STATE_CD is the provider’s U.S. state/territory location code used to identify the state associated with the provider record (e.g., mailing or service location).\n\nExpected format\n- 2-character uppercase USPS postal abbreviation (A–Z), e.g., NY, CA, TX, DC.\n- Includes U.S. territories where applicable (PR, VI, GU, AS, MP).\n- Stored as a STRING of length 2; use NULL or empty string when the state is unknown."
        },
        {
          "column_name": "STATE_DESC",
          "data_type": "STRING",
          "description": "Meaning\n- The STATE_DESC column contains the name of the U.S. state, territory, or equivalent jurisdiction associated with the provider (typically the provider's practice location or licensing state).\n\nExpected format\n- Full state/territory name as a string in Title Case (e.g., \"California\", \"New York\", \"District of Columbia\", \"Puerto Rico\").\n- No 2‑letter USPS abbreviations; no numeric codes.\n- Trimmed of leading/trailing whitespace, no mixed-case or all‑caps variants.\n- Null or standardized placeholders (e.g., \"Unknown\", \"Not Available\", \"Out of State\") may be used where state is not known.\n\nExamples\n- \"Texas\", \"Florida\", \"New Jersey\", \"Guam\", \"Puerto Rico\", null\n\nValidation guidance\n- Prefer matching a canonical list of U.S. states and territories (USPS names) for consistency and easy joins to state-level reference tables."
        },
        {
          "column_name": "TOTAL_DIAGNOSED_PATIENTS",
          "data_type": "LONG",
          "description": "Business definition\n- TOTAL_DIAGNOSED_PATIENTS is the count of distinct patients attributed to a provider who were diagnosed with the condition(s) of interest during the reporting/measurement period represented by the row.\n\nWhat it represents\n- A de-duplicated headcount (unique patients) who had one or more claims containing the relevant diagnosis codes while attributed to that provider. It is a patient-level count, not a claim count, rate or percentage.\n\nExpected format and constraints\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, ...). No decimals or negative values.\n- Nulls: may be NULL when the count is unknown or not applicable for the row.\n- Uniqueness/deduplication: patients should be deduplicated by patient identifier (e.g., member_id) within the provider + period scope.\n- Time/scope: depends on the table row keys — typically reflects the table's reporting period (e.g., monthly, quarterly, or year-to-date) and the provider to which the row pertains.\n\nNotes / caveats\n- The exact set of diagnosis codes, attribution rules, and measurement window used to determine a “diagnosed” patient are defined by upstream business logic; confirm the diagnosis code list and attribution rules if precise interpretation is required."
        },
        {
          "column_name": "UNIQ_LINES_CONTRIBUTING",
          "data_type": "LONG",
          "description": "Business description\n- Meaning: The number of distinct claim line items that contributed to this provider-level record/aggregation. In other words, how many unique service lines from underlying claims were counted toward the metrics in this row (e.g., sums of allowed amounts, paid amounts, or service counts).\n- Typical use: weighting or validating aggregated dollar/volume metrics, deduplication checks, and tracing activity back to underlying claim lines.\n\nExpected format and constraints\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, ...). 0 indicates no contributing lines; NULL indicates missing/unknown.\n- No decimals or negative values; should be an exact count of unique lines.\n- Typical cardinality: usually a small integer (often 1+) but can be larger for bundled or multi-line claims."
        },
        {
          "column_name": "MOST_PRESCRIBED_PRODUCT",
          "data_type": "STRING",
          "description": "Business description\n- The most frequently prescribed drug/product attributed to the provider (i.e., the single medication/product the provider wrote or was associated with most often during the measurement period). This value is derived from pharmacy/medication claims in the dataset.\n\nExpected format\n- Data type: STRING.\n- Human‑readable product name, often including brand/generic name plus strength and dosage form (examples: \"Atorvastatin 20 mg tablet\", \"Amoxicillin 500 mg capsule\", \"Insulin glargine 100 units/mL injection\").\n- May be NULL, empty, or contain a placeholder such as \"UNKNOWN\" when no dominant product can be determined.\n- Note: the field is free text and may not be standardized to RxNorm/NDC; for reliable analytics, map this value to a standard drug code in ETL and document tie‑breaking rules (prescription count vs. days‑supply/units) used to determine \"most prescribed.\""
        },
        {
          "column_name": "LEAST_PRESCRIBED_PRODUCT",
          "data_type": "STRING",
          "description": "Meaning\n- The name of the pharmaceutical product that a given provider prescribed the fewest times during the measurement/reporting period covered by this record. It identifies the single medication/product with the smallest prescription count for that provider.\n\nExpected value and format\n- Data type: STRING.\n- Typical content: a human-readable drug/product name, optionally including strength and form (examples: \"atorvastatin 20 mg tablet\", \"amoxicillin 500 mg suspension\"), or a product identifier when available (e.g., \"RxNorm:123456\" or \"NDC:00093-4151-01\"). The column contains one value per provider record.\n- Null/empty: returned when the provider has no prescriptions in the period or when the least-prescribed product cannot be determined.\n- Tie handling: when multiple products share the same minimum count, either a single canonical choice is returned (implementation-specific) or the value is set to NULL/marked as \"TIE\" — consumers should check downstream business rules or metadata for the system’s tie-break logic.\n\nNotes\n- Consumers should not assume a standardized identifier is present unless documentation specifies RxNorm/NDC usage; treat entries primarily as display names unless you confirm standard coding."
        },
        {
          "column_name": "MOST_PRESCRIBED_REGIMEN",
          "data_type": "STRING",
          "description": "Business description\n- Meaning: The single drug regimen most frequently prescribed by the provider (as observed in prescription/claims data for the reporting period). This is intended to represent the provider’s predominant treatment choice for a given condition or patient population, not an individual patient’s therapy.\n\nExpected format and content rules\n- Data type: free‑text string. Prefer standardized terms where available.\n- Canonical content: generic drug names (not brand names) for each regimen component; include combination components separated with “+” or “/”; optionally include strength and frequency. Example components: Drug name, strength, route and frequency in that order when provided.\n- Example values:\n  - Metformin 500 mg BID\n  - Lisinopril 20 mg QD\n  - Paclitaxel + Carboplatin\n  - Hydrocodone/acetaminophen 5/325 mg q6h PRN\n- Normalization guidance: when possible store an associated normalized identifier (e.g., RxNorm code) in a companion column; otherwise use consistent spelling/casing (prefer title case or UPPER for drug names).\n- Nulls and fallbacks: NULL or empty if no predominant regimen identified; a special token such as \"MULTIPLE\" or \"NO_SINGLE_REGIMEN\" may be used if no single regimen meets the predominance threshold.\n- Business rules (brief): computed from prescription claim counts/volumes over the measurement window; tie broken by higher aggregate days‑supply or most recent prescribing date.\n\nConstraints\n- Must not contain patient-identifying information.\n- Keep length reasonable (single-line description; avoid long free‑text notes)."
        },
        {
          "column_name": "LEAST_PRESCRIBED_REGIMEN",
          "data_type": "STRING",
          "description": "Concise business description\n- Meaning: The LEAST_PRESCRIBED_REGIMEN identifies the treatment regimen (single drug or combination therapy) that was prescribed least frequently for the entity represented by the record (e.g., a provider or provider practice) over the measurement period. It is intended to flag the uncommon/least-used regimen associated with that record for utilization, cost, or quality analyses.\n- Typical business use: spot low‑use therapies, examine prescribing variability or guideline non‑adherence, and support outlier or gap analyses.\n\nExpected format and rules\n- Data type: string. Value should be a human-readable regimen identifier.\n- Recommended content: drug names (generic preferred) and, optionally, dose/frequency or an internal regimen code. If a multi‑drug regimen, list components separated by \" + \".\n- Examples:\n  - \"metformin 500 mg BID\"\n  - \"pembrolizumab 200 mg IV q3w\"\n  - \"lenalidomide + dexamethasone\"\n  - \"REGIMEN_CODE_123 (docetaxel + cisplatin)\"\n- Nulls/ties: null (or empty string) if no prescriptions exist for the period, if data insufficient, or if multiple regimens are tied for least-prescribed (unless tie-breaking logic is applied).\n- Normalization: prefer standardized vocabularies (RxNorm IDs or internal regimen codes) where downstream joins or analytics require unambiguous matching.\n\nNotes\n- The precise semantics (per‑patient vs. per‑provider aggregation, measurement period, tie-breaking rules) depend on the ETL/business rules that populated the table; consult the pipeline spec for those specifics."
        }
      ]
    }
  }
]