[
  {
    "catalog": "ct_sm_chatbot_auxo",
    "schema": "claims_summaries",
    "table": {
      "table_name": "patient_provider",
      "table_description": "What this table is\n- This table profiles the relationship between individual patients and the providers who treated them, based on claims and pharmacy/therapy records. Each row represents a patient-provider pair and summarizes the patient’s demographics, the provider’s identifiers and specialties, how many claims and months of care occurred, therapy/regimen details, and flags about treatment timing.\n\nWhy it’s useful (business value)\n- Provider performance and utilization: compare volumes, typical regimens, and treatment patterns by provider or specialty.\n- Patient journey and continuity: see when care started and ended, how many distinct lines of therapy patients received with a given provider, and whether the provider initiated treatment.\n- Product and regimen insight: identify which drugs or regimens a provider most commonly prescribes (useful for formulary, sales targeting, and clinical pathway assessment).\n- Network and geographic analysis: aggregate by ZIP, state, or specialty to inform network planning, marketing, or access issues.\n- Quality and adherence monitoring: use counts of claims, months of coverage, and regimen switches to infer persistence, switching, or fragmentation of care.\n\nColumn-by-column business-friendly guide\n- PATIENT_ID: internal patient identifier (row-level subject).\n- PAT_AGE: patient age (useful for age-segmentation or cohort analysis).\n- GENDER_DESC: patient gender.\n- PROVIDER_ID: internal provider identifier (links to provider master records).\n- NPI: provider’s national provider identifier (standard external identifier).\n- PRI_SPECIALTY_DESC: provider’s primary specialty description (e.g., oncology).\n- SEC_SPECIALTY_DESC: secondary specialty, if present.\n- ZIPCODE / STATE_CD / STATE_DESC: geographic location of provider or claim (zip and state info for regional analyses).\n- No_of_Claims: total claim count between the patient and this provider (activity volume).\n- FIRST_SERVICE_DATE / LATEST_SERVICE_DATE: earliest and most recent dates of service in the claims data (care window).\n- FIRST_LINE_START: date the first recorded line of therapy began for this patient with this provider (therapy initiation context).\n- LAST_LINE_END: date the most recent line of therapy ended (therapy completion/transition context).\n- LINES_CONTRIBUTING: number of distinct therapy lines attributed to this patient-provider relationship.\n- COUNT_MONTHS: count of months with claims activity between this patient and provider (treatment duration or engagement length).\n- UNIQ_DRUGS_WITH_NPI: count of unique drugs prescribed/dispensed to this patient by this provider (treatment breadth).\n- UNIQ_FINAL_REGIMEN_NAME_WITH_NPI: count of unique final regimen names observed for this patient with this provider (distinct regimen endpoints).\n- MOST_PRES_REGIMEN / MOST_PRES_REGIMEN_COUNT: the single most-prescribed regimen name for this patient-provider pair and how many times it was prescribed.\n- MOST_PRES_PRODUCT / MOST_PRES_PRODUCT_COUNT: the single most-prescribed drug/product and its count.\n- TREATMENT_INITIATION_FLAG: indicator whether this provider is recorded as initiating treatment for the patient (helps identify primary initiators).\n- IS_LATEST_LOT_FLAG: indicator whether the record corresponds to the latest observed treatment lot/line for the patient with this provider (useful for focusing on current therapy).\n\nPractical notes and cautions\n- Provider identifiers: NPI is a standard public identifier, but combine with internal PROVIDER_ID for vendor/system linkage.\n- Patient privacy: PATIENT_ID should be protected and handled under applicable privacy and compliance rules before sharing.\n- Interpretation: counts and “most-prescribed” values are based on claims data and the table’s attribution rules (e.g., “WITH_NPI” implies prescriptions/claims tied to this provider). Validate attribution logic when making inference about responsibility for treatment decisions.\n- Timeliness & completeness: claims can lag; check data refresh cadence and whether pharmacy/medical claims are fully captured.\n\nTypical business questions you can answer with this table\n- Which providers initiated the most patients on a particular regimen in a state or ZIP code?\n- Which providers prescribe a given drug most frequently, and how persistent are their patients?\n- Which specialties have the highest average number of lines of therapy per patient?\n- How many months of care do patients typically receive from each provider before switching or stopping therapy?\n\nIf you want, I can (a) map these columns to common KPIs and suggest SQL queries to compute them, or (b) propose dashboards and visualizations that best exploit this table.",
      "columns": [
        {
          "column_name": "PATIENT_ID",
          "data_type": "STRING",
          "description": "Column name: PATIENT_ID\n\nBusiness meaning:\n- A stable, unique identifier that represents an individual patient within the claims/provider dataset. It is used to link that patient’s records across claims, provider interactions, and related tables.\n\nExpected format and constraints:\n- Data type: string.\n- Should be non-null and unique per patient within the dataset (consistent across tables).\n- Common representations: a numeric string, an alphanumeric key, a UUID, or a hashed/de‑identified identifier assigned by the source system. Do not expect plain-text PHI (names, SSNs); identifiers should be privacy-protected per policy.\n- Allowed characters: typically alphanumeric and may include dashes/underscores depending on source. Length is variable (depends on upstream system), but treat as a variable-length string rather than a fixed-width numeric field.\n\nExamples:\n- 1234567890\n- f47ac10b-58cc-4372-a567-0e02b2c3d479\n- A12345_hashedValue\n\nPurpose notes:\n- Use this column to join patient-level data across tables. Do not attempt to derive personal attributes from the ID; rely on authorized fields for identifiable information."
        },
        {
          "column_name": "PAT_AGE",
          "data_type": "STRING",
          "description": "Meaning\n- PAT_AGE is the patient's age at the time of the claim/encounter recorded in this patient_provider summary.\n\nExpected format\n- Stored as a STRING but represents a numeric age in years.  \n- Preferred canonical value: whole-number year as characters (e.g., \"0\", \"1\", \"34\", \"78\").  \n- Acceptable range: typically 0–130. Nulls or empty strings are allowed when age is unavailable.\n\nNotes for downstream use\n- Convert to integer for calculations and aggregations; treat non‑numeric values (e.g., \"Unknown\", \"<1\") as missing or map \"<1\" to 0 / a special indicator.  \n- Validate and clean strings (trim whitespace, remove unit suffixes like \" yrs\" if present) before numeric conversion.\n\nExamples\n- \"0\", \"5\", \"29\", \"82\""
        },
        {
          "column_name": "GENDER_DESC",
          "data_type": "STRING",
          "description": "Purpose\n- Describes the patient’s gender as recorded on the claim or provider record; used for reporting, cohort selection, risk stratification and demographic analyses.\n\nExpected content and semantics\n- A short, human-readable label indicating the patient’s gender (not an ID or code). This field reflects how gender was recorded at source (administrative/claims data) and may not equal self‑identified gender.\n\nRecommended format and allowed values\n- STRING, case-insensitive, single-value labels. Prefer a controlled vocabulary such as:\n  - \"Male\"\n  - \"Female\"\n  - \"Other\" (non-binary / third gender)\n  - \"Unknown\" or \"Unspecified\"\n  - \"Declined\" or \"Prefer not to say\"\n- If your system uses single-character codes, map them to these labels before storing (e.g., \"M\" → \"Male\", \"F\" → \"Female\", \"U\" → \"Unknown\").\n- Keep values short (recommend <= 20 characters) and avoid free‑text variations (\"male \", \"MALE\", \"m\").\n\nNulls and fallbacks\n- NULL or empty string is allowed when no gender value is available. Prefer explicit \"Unknown\" or \"Unspecified\" over NULL when the absence of data should be distinguished from missing.\n\nData quality notes\n- Source may be legacy/administrative sex or provider‑reported; expect occasional misclassification. Document source system and any transformations used to normalize values.\n- Handle this as sensitive demographic information in line with privacy/regulatory requirements.\n\nExamples\n- \"Female\", \"Male\", \"Other\", \"Unknown\", \"Declined\""
        },
        {
          "column_name": "PROVIDER_ID",
          "data_type": "STRING",
          "description": "Meaning\n- PROVIDER_ID is the stable, unique identifier for the healthcare provider associated with a claim or summary record. It is used to link provider information across tables and to aggregate or filter records by provider.\n\nExpected format\n- Data type: string (stored as text so leading zeros, letters, or punctuation are preserved).\n- Common formats you may encounter:\n  - NPI: 10 numeric digits, e.g. 1234567890 (regex: ^\\d{10}$)\n  - Internal alphanumeric ID: letters/numbers and optional underscore/hyphen, e.g. PRV_00123 (regex: ^[A-Za-z0-9_-]{1,50}$)\n  - UUID: hyphenated 36-character hex string, e.g. 550e8400-e29b-41d4-a716-446655440000 (regex: ^[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}$)\n\nBusiness expectations / quality checks\n- Unique and stable for each provider within the dataset (no reuse of IDs across different providers).\n- Consistent format across rows (or documented mapping if multiple ID schemes are used).\n- Non-null for records that require an identified provider; if pseudonymized, document mapping method for traceability.\n- Use to join to a provider master table for name, specialty, and location.\n\nPrivacy note\n- If PROVIDER_ID contains direct identifiers (e.g., original NPIs), treat according to applicable data protection and sharing policies."
        },
        {
          "column_name": "NPI",
          "data_type": "STRING",
          "description": "- Meaning: National Provider Identifier (NPI) — the unique 10‑digit identifier assigned by the U.S. Centers for Medicare & Medicaid Services to individual healthcare providers or provider organizations. Used to identify the patient’s billing/attending/provider party in claims and summaries.\n\n- Expected format: string of exactly 10 numeric characters (0–9). Store as a string to preserve leading zeros. Do not include spaces, dashes or other punctuation.\n\n- Validation rules / notes:\n  - Length = 10 digits.\n  - Digits only (no letters or punctuation).\n  - May be null/empty if provider NPI is not available.\n  - Can be used to join to provider registries or other datasets; treat as an identifier, not a numeric value for arithmetic.\n\n- Examples: \"1234567890\", \"0054321001\""
        },
        {
          "column_name": "PRI_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Meaning\n- Human-readable description of the provider’s primary clinical specialty associated with the patient/claim record (i.e., the specialty of the provider of record on the claim or patient-provider relationship).\n\nExpected format\n- STRING containing a standardized descriptive name such as \"Family Medicine\", \"Internal Medicine\", \"Cardiology\", \"Pediatrics\", \"Obstetrics/Gynecology\", \"Psychiatry\", \"Radiology\", etc.\n- Prefer Title Case, no leading/trailing whitespace, no special punctuation; use a single specialty phrase or a small, delimited list if multiple specialties apply (e.g., \"Internal Medicine / Geriatrics\").\n- Typical maximum length: keep under 100 characters (recommended ≤50–75 characters) to avoid truncation.\n\nBusiness/analytic notes\n- Values should map to a controlled vocabulary where possible (e.g., CMS/NPI taxonomy or an internal specialty code list) for consistent grouping and reporting.\n- Allow NULL or \"UNKNOWN\"/\"UNSPECIFIED\" if specialty is not available.\n- Recommended validations: trim whitespace, normalize synonyms (e.g., \"Gen. Pract.\" → \"General Practice\"), and validate against the canonical specialty list to minimize free-text variance."
        },
        {
          "column_name": "SEC_SPECIALTY_DESC",
          "data_type": "STRING",
          "description": "Meaning\n- Secondary specialty description for the provider associated with the patient/claim. It records the provider’s additional (non-primary) clinical specialty as a human‑readable label.\n\nExpected format\n- STRING containing a short, standardized specialty name (title case preferred), e.g. \"Cardiology\", \"Family Medicine\", \"Pediatrics\", \"Anesthesiology\", \"Psychiatry\", \"Surgical Oncology\", or compound labels like \"Internal Medicine/Pediatrics\".\n- Single value per row; no free‑form notes, contact info, or codes in this field.\n- Trim leading/trailing whitespace; avoid control characters.\n- Use a controlled vocabulary whenever possible (map to taxonomy codes if available). If a provider has no secondary specialty, field may be NULL/empty.\n\nRecommended constraints (business best practices)\n- Limit length (example: ≤100 characters).\n- Maintain a reference table of allowed specialty descriptions and corresponding taxonomy codes to enable consistent reporting and analytics."
        },
        {
          "column_name": "ZIPCODE",
          "data_type": "STRING",
          "description": "Column purpose\n- ZIPCODE stores the postal ZIP code associated with the patient/provider address recorded in this row. It is used for routing, geocoding, regional reporting, and linking to external demographic or service-area datasets.\n\nExpected format and validation (business rules)\n- Data type: STRING to preserve leading zeros and allow optional punctuation.\n- Preferred canonical forms (pick one companywide):\n  - 5-digit: \"01234\"\n  - 9‑digit (ZIP+4): \"01234-5678\" or \"012345678\" (hyphen optional)\n- Allowed characters: digits 0–9 and an optional single hyphen between the 5th and 6th digit when using ZIP+4.\n- Maximum length: 10 characters (including hyphen) or 9 digits if stored without hyphen.\n- Trim leading/trailing whitespace; store NULL for unknown/unavailable ZIP codes.\n- Should conform to USPS ZIP codes for U.S. addresses; non‑U.S. postal codes should be stored in a separate international_postal_code field (or clearly flagged).\n\nExamples\n- Valid: \"10001\", \"02115-1234\", \"021151234\"\n- Invalid: \"ABC123\", \"1234\" (too short), \"123456\" (6 digits), \"12 345\"\n\nPrivacy note\n- This column contains address-related PII and should be handled according to applicable privacy/security policies."
        },
        {
          "column_name": "STATE_CD",
          "data_type": "STRING",
          "description": "Business description\n- STATE_CD records the U.S. state or territory code associated with the patient/provider address on the claims summary row.\n\nExpected format\n- Two-character uppercase USPS postal abbreviation (length = 2): e.g., NY, CA, TX. Includes DC and territories (PR, VI, GU, AS, MP).\n- No punctuation or whitespace. Use NULL when the state is unknown or not applicable.\n- Validate against the standard USPS state/territory list (do not use full state names, numeric FIPS, or ISO codes)."
        },
        {
          "column_name": "STATE_DESC",
          "data_type": "STRING",
          "description": "Meaning\n- Descriptive name of the U.S. state/territory associated with the patient or provider address on the claims summary. This is the human-readable state/territory name (the “description”), not the two‑letter code.\n\nExpected format and rules\n- Type: string (text).\n- Content: full official state or territory name (e.g., California, New York, District of Columbia, Puerto Rico).\n- Casing/formatting: title case, trimmed, no trailing punctuation (e.g., \"New York\", not \"NEW YORK\" or \"NY.\").\n- Length: typically ≤ 50 characters.\n- Allowed values: the 50 U.S. states plus common territories (e.g., District of Columbia, Puerto Rico, Guam, U.S. Virgin Islands). Use a controlled list to ensure consistency.\n- Nulls/unknowns: use a standard sentinel such as NULL or the agreed token (e.g., \"Unknown\"/\"Not Available\") consistently; avoid free-text variants.\n\nNotes/usage\n- Prefer canonical names aligned with USPS/state naming conventions for reporting, aggregation, geolocation, and regulatory filtering. If a two‑letter state code is needed for processing, map this column to the corresponding code in the authoritative lookup table."
        },
        {
          "column_name": "No_of_Claims",
          "data_type": "LONG",
          "description": "Meaning\n- The No_of_Claims column records the total number of claims associated with the given patient–provider pair for the reporting/summary period represented by the row. It is a simple count of claim records.\n\nExpected format and rules\n- Data type: LONG (integer).\n- Value domain: non‑negative whole numbers (0, 1, 2, ...). No decimals.\n- 0 indicates no claims in the period; NULL may be used when the count is unknown or not applicable.\n- Count semantics: counts claim occurrences (or distinct claim IDs) per patient‑provider for the summary window—should be calculated consistently (e.g., one per unique claim identifier).\n- Typical constraints: must be ≥ 0 and reasonably bounded by the population (no negative values).\n\nExamples\n- 0 (no claims), 1 (one claim), 27 (twenty‑seven claims)."
        },
        {
          "column_name": "FIRST_SERVICE_DATE",
          "data_type": "STRING",
          "description": "Business definition\n- FIRST_SERVICE_DATE is the earliest billed service date recorded for the specific patient–provider relationship in this claims summary. It represents the first day on which the provider delivered a billable service to the patient in the available claims/observation window.\n\nDerivation/Granularity\n- Calculated as the minimum service date across claim lines (or claims) where patient and provider match. Granularity is at the patient–provider pair level.\n\nExpected format and values\n- Stored as a string in ISO date format: \"YYYY-MM-DD\" (e.g., \"2021-03-15\").\n- If the date is unknown or outside the data window, the field will be NULL or empty string per dataset conventions.\n\nBusiness usage notes\n- Use to measure length of relationship, cohort entry, lookback windows, and continuity of care. It is a billing/service date, not an admission/discharge or encounter timestamp; it may be truncated by the available claims history."
        },
        {
          "column_name": "LATEST_SERVICE_DATE",
          "data_type": "STRING",
          "description": "Meaning\n- The most recent date on which the provider rendered a billable service to the patient (i.e., the latest service/claim date for the patient–provider pair represented in this summary row).\n\nExpected format (stored as STRING)\n- Preferred canonical form: ISO 8601 date: YYYY-MM-DD (e.g., 2024-02-28).\n- If a time portion is included, use full UTC datetime: YYYY-MM-DDThh:mm:ssZ (e.g., 2024-02-28T13:45:00Z).\n- Empty or missing values indicate no known service date for the patient–provider pair; some legacy records may contain placeholders like \"NULL\" or \"0000-00-00\" and should be treated as null.\n\nNotes / usage\n- This field is derived from claim/service records and represents the latest service date across all claims for that patient and provider; it is not a transaction timestamp.\n- Because the column is a STRING, downstream processes should parse/validate the value and convert to a date/datetime type before performing date arithmetic or comparisons."
        },
        {
          "column_name": "FIRST_LINE_START",
          "data_type": "STRING",
          "description": "Business description:\n- What it is: The leading text of the primary address line for the patient’s provider (i.e., the beginning portion of Address Line 1). This field is used for address matching, display and basic normalization rather than as the full, postal-ready address.\n- Purpose: support entity matching/standardization, search and grouping by street/start of provider address.\n\nExpected format:\n- Data type: string. Typically contains the street number and the start of the street name or other primary identifier (e.g., directional or unit prefix).\n- Examples: \"123 Main St\", \"450B W Elm Ave\", \"PO Box 42\", \"Suite 200 — 10 Broad St\" (first segment).\n- Constraints/recommendations: single-line text, trimmed of leading/trailing whitespace, no embedded newlines; may be truncated and is not guaranteed to be a complete mailing address; null allowed when no address is available. Prefer normalized formatting (consistent casing and standard abbreviations) for reliable matching."
        },
        {
          "column_name": "LAST_LINE_END",
          "data_type": "STRING",
          "description": "Meaning\n- The date when the final service line on the claim(s) between the patient and provider ended. In other words, the end date of the most recent service line included in the patient–provider summary.\n\nExpected format\n- String representing a date (preferably ISO 8601). Recommended canonical format: \"YYYY-MM-DD\".\n- May be NULL/empty when no service-line end date is available.\n- If time or timezone is present, use full timestamp form: \"YYYY-MM-DDTHH:MM:SSZ\" (or with offset).\n\nExamples\n- \"2025-01-31\"\n- \"2025-01-31T14:30:00Z\"\n- NULL\n\nNotes\n- Use the most recent service-line end date when multiple claims/lines are aggregated.\n- Validate incoming values as parsable ISO 8601 dates for downstream processing."
        },
        {
          "column_name": "LINES_CONTRIBUTING",
          "data_type": "LONG",
          "description": "Concise business description:\n- LINES_CONTRIBUTING is a count of claim service lines that were used to produce the patient–provider summary record. It represents how many individual claim-line entries (service/line-level records) contributed to the aggregated metrics for that patient–provider pair.\n\nExpected format and rules:\n- Type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, ...). Typical range depends on volume; 0 indicates no contributing lines in the reporting window.\n- Calculation: derived by counting distinct, accepted claim lines associated with the patient and provider for the summary period. Excludes lines that were voided, fully denied, or filtered out by the business logic (e.g., non-billable adjustments) unless your pipeline explicitly includes them.\n- Null handling: should be 0 rather than NULL when there are no contributing lines; NULL only if the record itself is invalid or not populated.\n- Usage: used for weighting, filtering (e.g., require >=1 to show active relationships), and diagnostic/error checks.\n\nExample values: 0, 1, 12, 345."
        },
        {
          "column_name": "COUNT_MONTHS",
          "data_type": "LONG",
          "description": "Column name: COUNT_MONTHS\nType: LONG (integer)\n\nBusiness description:\n- The number of calendar months represented in the patient–provider claim summary. Specifically, the count of distinct months during which the patient and provider had claim activity within the summary period (or the number of months covered by the summary window for that patient–provider pair).\n- Used to normalize or aggregate monthly metrics (e.g., claims per month, average cost per month) and to filter summaries by duration.\n\nExpected format and rules:\n- Integer value (no decimals), >= 0.\n- Typical values: 1, 2, ..., N (0 may be used if no activity is present; alternatively the field can be null if no months apply depending on implementation).\n- Derived from claim dates by counting distinct year–month combinations (e.g., 2024-01, 2024-02) within the summary window."
        },
        {
          "column_name": "UNIQ_DRUGS_WITH_NPI",
          "data_type": "LONG",
          "description": "Meaning\n- The column stores a count of distinct drug products (unique drug identifiers) that appear on claims which are tied to a provider NPI for the patient–provider summary row. In other words, how many different drugs that provider (as identified by NPI) is associated with for that patient.\n\nExpected format\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, ...); NULL if no applicable claim data.\n- Unit: count of unique drug records (typically distinct NDC/GPI or whatever drug identifier the upstream pipeline uses), not a list of names.\n\nBusiness notes\n- This is a measure of prescribing/prescription association breadth for the provider on the patient–provider record (useful for utilization and physician activity metrics).\n- Ensure you understand which drug identifier (NDC, GPI, RXCUI, etc.) was used upstream, since that determines what “unique” means."
        },
        {
          "column_name": "UNIQ_FINAL_REGIMEN_NAME_WITH_NPI",
          "data_type": "LONG",
          "description": "Meaning\n- A single, unique numeric key that identifies the final treatment regimen associated with a specific provider for a patient/claim summary. It combines the final regimen identifier and the provider’s NPI so the pair can be used for grouping, linking and de-duplication.\n\nExpected format\n- Data type: LONG (numeric).\n- Composition: concatenation of a regimen identifier (internal regimen_id or encoded regimen value) immediately followed by the provider’s 10‑digit NPI, yielding a single integer with no separators.\n- Nulls: NULL when either the final regimen or provider NPI is missing.\n\nExample\n- If regimen_id = 12345 and provider NPI = 1234567890, stored value = 123451234567890.\n\nImportant notes\n- Because the field is numeric, any leading zeros in the NPI portion will be lost; if preserving leading zeros is required, store the value as a string instead."
        },
        {
          "column_name": "MOST_PRES_REGIMEN",
          "data_type": "STRING",
          "description": "Meaning\n- The column records the single treatment regimen most frequently prescribed to a patient by the listed provider during the claims summary period (e.g., measurement window such as last 12 months). It represents the dominant medication therapy (single agent or combination) used to manage the patient’s condition.\n\nExpected format\n- Data type: STRING (text).\n- Preferred content: a canonical, human-readable regimen identifier that clearly lists active ingredient(s) and, where available, strength and dosing frequency or a standardized code (RxNorm/RxCUI). Use a consistent delimiter for combination therapies (recommended: \" + \").\n- Length: keep concise (suggest <= 255 characters).\n- Null/unknown: use NULL for unknown or no prescriptions; if a sentinel value is required use a consistent token such as \"UNKNOWN\" or \"NONE\".\n\nExamples\n- Single agent with dose/frequency: \"Metformin 500 mg PO BID\"\n- Single agent without dose: \"Atorvastatin 20 mg\"\n- Combination therapy: \"Lisinopril + Hydrochlorothiazide\"\n- Standard code alternative: \"RxCUI:123456 (Metformin 500 mg PO BID)\"\n\nBusiness rules / notes\n- Populate with the regimen having the highest prescription volume (count or days supply) for that patient–provider pair in the measurement window. If tied, use the most recently prescribed regimen.\n- Prefer normalized identifiers (RxNorm/RxCUI) or a controlled naming convention to support downstream analytics and de-duplication."
        },
        {
          "column_name": "MOST_PRES_REGIMEN_COUNT",
          "data_type": "LONG",
          "description": "Meaning\n- The number of times the single most‑frequently prescribed treatment regimen (drug or regimen code) was prescribed/administered for the given patient–provider summary period. In other words, across all regimens recorded for that patient with that provider during the summary window, this column holds the highest prescription count for any one regimen. If two or more regimens tie for highest frequency, the column contains that tied maximum.\n\nExpected format and constraints\n- Data type: LONG (signed 64‑bit integer).\n- Allowed values: non‑negative integer (0, 1, 2, …). Typical values are small integers (e.g., 0–100).\n- Null handling: NULL or 0 indicates no regimen records for the patient–provider in the summary period (system convention should be documented and applied consistently).\n- Example: if a patient received Regimen A 5 times, Regimen B 2 times, and Regimen C 5 times, MOST_PRES_REGIMEN_COUNT = 5."
        },
        {
          "column_name": "MOST_PRES_PRODUCT",
          "data_type": "STRING",
          "description": "Description\n- MOST_PRES_PRODUCT is the single medication/product most frequently prescribed in the patient–provider relationship for the claims summary period. It identifies which drug product was prescribed the greatest number of times for that patient by (or attributed to) that provider.\n\nExpected format and content\n- STRING containing a human-readable product identifier (preferred: standardized name). Examples: \"atorvastatin 20 mg tablet\", \"metformin XR 500 mg\", \"insulin glargine\".\n- Prefer use of a normalized vocabulary (RxNorm name or RxNorm + strength/form). If standardized concept IDs are used, place them in a separate numeric column (e.g., RXCUI); this column should remain the readable product name.\n- If no prescriptions exist for the patient–provider pair, the value should be NULL/empty.\n- If multiple products tie for top frequency, business logic should be applied (e.g., choose the most recent, choose alphabetically, or set to NULL); document the chosen tie-breaking rule elsewhere.\n\nNotes\n- Intended for analytics on prescribing patterns, medication adherence and population summaries."
        },
        {
          "column_name": "MOST_PRES_PRODUCT_COUNT",
          "data_type": "LONG",
          "description": "Meaning\n- The number of prescription claims for the single product that was prescribed most often for a given patient–provider pair during the measurement period. In other words, identify the product with the highest prescription count for that patient from that provider and store its count here.\n\nBusiness rules / notes\n- Count is an aggregated number of prescription claims (typically including fills and recorded refills) as found in the claims data.\n- Computed per patient-provider pair; if multiple products tie for highest count, the (any) highest count value is recorded.\n- If the patient had no prescriptions from the provider during the period, the value will be 0 or NULL depending on ETL rules.\n\nExpected format\n- Data type: LONG (integer).\n- Values: non‑negative integers (0, 1, 2, …). Example values: 0, 1, 5, 12."
        },
        {
          "column_name": "TREATMENT_INITIATION_FLAG",
          "data_type": "INT",
          "description": "Business definition\n- Indicates whether the provider initiated (started) a course of treatment for the patient on the claim/encounter represented by this record.\n\nExpected values / format\n- Data type: INT (binary flag).\n- Typical values:\n  - 1 = treatment was initiated by the provider during this claim/encounter.\n  - 0 = treatment was not initiated during this claim/encounter.\n  - NULL = unknown or not applicable / no information available.\n- Stored as integer 0/1 (NULL permitted); no free text.\n\nNotes / usage\n- Used for cohort selection and analytics (e.g., count of visits that resulted in treatment starts).\n- Derived from claim/EHR indicators (start-of-therapy codes, procedure codes, authorization records) — confirm source logic if exact derivation matters.\n- If your environment uses additional codes (e.g., 2 = deferred), consult the system data dictionary and normalize to {0,1} for standard analyses."
        },
        {
          "column_name": "IS_LATEST_LOT_FLAG",
          "data_type": "INT",
          "description": "Meaning\n- IS_LATEST_LOT_FLAG is a boolean-style flag (stored as an INT) that marks whether a given patient–provider claim summary row comes from the most recent ingest/processing \"lot\" (batch).\n- It is used to identify the current/latest record for reporting, de-duplication and downstream joins.\n\nExpected format / values\n- 1 = this row is from the latest lot (true/current).\n- 0 = this row is not from the latest lot (false/older).\n- NULL = unknown / not set (treat as 0 unless otherwise specified).\n\nBusiness rules / usage\n- The ETL/ingest process sets this flag; typically exactly one record per patient/provider (or per defined key) should have IS_LATEST_LOT_FLAG = 1 for the current data source.\n- Common usage: filter WHERE IS_LATEST_LOT_FLAG = 1 to get the current snapshot.\n- Validate during ingestion that values are only 0 or 1 (or NULL if allowed) and that the latest-lot constraint is enforced."
        }
      ]
    }
  },
  {
    "catalog": "ct_sm_chatbot_auxo",
    "schema": "claims_summaries",
    "table": {
      "table_name": "patient_lot",
      "table_description": "What this table is\n- This table provides patient-level, claim-derived summaries that track treatment “lines” and associated product/regimen usage for individual patients. \n- Each record represents a single patient’s summary for a specific treatment line (or the current activity/lot associated with that patient). The data are aggregated from claims and intended for business analyses such as utilization, patient segmentation, adherence, product/lot tracking, and provider network analysis.\n\nHow the table is typically used\n- Monitor which regimens/products patients are using and when each treatment line started and ended.\n- Measure utilization and persistence (days supplied, active status, months with claims).\n- Count distinct providers, regimens and products seen by a patient—useful for care coordination and referral analysis.\n- Identify the most-used product per patient and whether the patient is newly initiated.\n- Group or filter patients by “lot” or cohort labels (CURRENT_LOT / LATEST_LOT) for campaign, inventory or cohort analyses.\n\nColumn-by-column, business-friendly definitions\n- PATIENT_ID: De-identified patient identifier (one ID per patient).\n- PAT_AGE: Patient age (as of the reference date when the summary was created).\n- GENDER_DESC: Patient gender description (e.g., Male, Female, Other/Unknown).\n- LINE_NO: Treatment line number (e.g., 1 for first-line therapy, 2 for second-line).\n- REGIMEN_NAME: Name or label of the treatment regimen associated with this line.\n- LINE_START: Start date of this treatment line (first claim/service date for the line).\n- LINE_END: End date of this treatment line (last claim/service date for the line), if applicable.\n- IS_ACTIVE: Flag indicating whether this treatment line is currently active (true/false).\n- CURRENT_LOT: The patient’s current lot/cohort label or batch assignment (business-defined grouping).\n- LATEST_LOT: The most recent lot/cohort the patient was included in (may differ from CURRENT_LOT if reassigned).\n- UNIQ_CLAIM_COUNTS: Number of unique claims contributing to this summary (claim events count).\n- UNIQ_PROVIDERS_COUNT: Count of distinct providers seen by the patient in this context.\n- UNIQ_REGIMEN_COUNT: Number of distinct regimens the patient has received (shows regimen changes).\n- UNIQ_PRODUCT_COUNT: Number of distinct products (drugs/devices) used by the patient.\n- AVG_DAYS_SUPPLY_UPD: Average days’ supply per prescription or dispense (updated/normalized).\n- NO_OF_UNIQ_MONTHS: Number of unique calendar months in which the patient had qualifying claims (measure of persistence/continuity).\n- MOST_USED_PROD: Identifier or name of the product the patient used most frequently in the period.\n- MOST_USED_PROD_COUNT: Count of fills/claims for the most-used product.\n- IS_NEW: Flag indicating whether the patient is newly initiated (new to therapy/cohort) in the reporting window.\n\nNotes and interpretation tips\n- Records are aggregated from claims-level data; dates and counts reflect what is available in the claims feed.\n- “Lot” fields are business-defined cohort/batch labels—confirm the lot naming convention with the business owner before using for operational decisions.\n- Use UNIQ_* metrics and AVG_DAYS_SUPPLY_UPD to assess adherence, persistence, and fragmentation of care (multiple providers or regimen switches).\n- PATIENT_ID is expected to be de-identified for privacy; do not attempt to re-identify patients.",
      "columns": [
        {
          "column_name": "PATIENT_ID",
          "data_type": "STRING",
          "description": "Concise business description — PATIENT_ID\n\n- Meaning: A unique identifier for a patient used to link claims and summary data. This value represents the patient record (or a de-identified surrogate) rather than any personal attribute (name, SSN, DOB).\n- Purpose: Use for joins, grouping, de-duplication and tracking a patient’s claims across records and reporting batches.\n- Expected format: an opaque string (alphanumeric, may include dashes). Common patterns include a system GUID/UUID (e.g., a3f47b12-9c3e-4b2f-8f1d-0e2a7c9d5f6b), a hashed/pseudonymized MRN, or a fixed-prefix code (e.g., PAT00012345). Typical length: ~8–36 characters.\n- Constraints and usage notes:\n  - Must be non-null and unique per patient within the dataset/batch.\n  - Should be stable/persistent across extracts so longitudinal joins are reliable.\n  - Treat as sensitive (PHI) if it is reversible or linkable to real identities; apply appropriate access controls and encryption.\n  - Stored as case-sensitive string; avoid embedding semantic info (no embedded DOBs or meaningful codes).\n- Example values: 12345678, PAT00098765, a3f47b12-9c3e-4b2f-8f1d-0e2a7c9d5f6b."
        },
        {
          "column_name": "PAT_AGE",
          "data_type": "STRING",
          "description": "Business definition\n- PAT_AGE is the patient’s age associated with the claim/summary record — i.e., the age of the patient at the time of service or the claim event.\n\nExpected format and content\n- Stored as a string but represents age in years.\n- Preferred canonical form: whole years as numeric characters (e.g., \"0\", \"1\", \"45\", \"87\").\n- Possible non‑numeric variants that may appear and should be handled:\n  - Ranges or capped values: \"90+\", \"100+\".\n  - Newborns/infants: \"<1\", \"0\" or ages expressed in months (\"3M\") or days (\"14D\") — these should be normalized if needed.\n  - Missing/unknown: \"\", \"NULL\", \"UNK\", \"N/A\".\n  - Textual suffixes: \"45 yrs\", \"45 years\", \"45 Y\" — should be stripped/normalized.\n\nValidation rules and recommendations\n- Normalize to an integer years field for analysis: strip units/suffixes, map ranges/caps to numeric or categorical (e.g., \"90+\" -> 90 or a \"90+\" category), convert \"<1\"/months/days into 0 or use an age-in-days/months field if fine granularity required.\n- Enforce plausible bounds (e.g., 0–120). Flag outliers and non‑numeric entries for review.\n- Treat blank/explicit unknowns as NULL.\n\nPrivacy note\n- For regulatory/privacy compliance, records of very old ages may be masked (e.g., ages 90+), so expect capped values in some datasets."
        },
        {
          "column_name": "GENDER_DESC",
          "data_type": "STRING",
          "description": "Purpose\n- Human-readable gender label for the patient; a categorical description derived from patient demographics used for reporting, filtering and analytics.\n\nExpected content / values\n- Short categorical values such as: \"Male\", \"Female\", \"Other\", \"Non‑Binary\", \"Unknown\", \"Not Specified\" (or similar standardized labels). Legacy single-letter values (\"M\", \"F\") may appear but should be normalized where possible.\n\nFormat and rules\n- Data type: STRING.\n- Stored as a short text token (recommended max length 20–50 characters).\n- Prefer a controlled vocabulary (capitalization consistent, e.g., Title Case or UPPER) to avoid duplicates.\n- Nulls or \"Unknown\"/\"Not Specified\" indicate missing/uncollected gender information.\n- Note: This field contains a gender descriptor (identity label) and should be treated as demographic — apply privacy controls appropriate for patient data."
        },
        {
          "column_name": "LINE_NO",
          "data_type": "STRING",
          "description": "Business description:\n- LINE_NO identifies a specific service or detail line within a patient’s claim/lot. It distinguishes multiple line items (procedures, services, revenue codes) that belong to the same claim or patient_lot record and is used to join or aggregate line-level data.\n\nExpected format:\n- Stored as a string but represents a sequential integer (the line index) for the claim/lot.\n- Typical values: \"1\", \"2\", \"3\", … (occasionally zero‑padded like \"01\" or \"001\" in some sources).\n- Should contain only digits (no decimals, letters, or special characters) unless your source system uses an alphanumeric code.\n- Uniqueness is usually scoped to the claim or patient_lot (i.e., LINE_NO combined with the claim/patient_lot identifier identifies a single line).\n\nExamples:\n- \"1\", \"2\", \"10\" (or \"01\", \"02\" if zero-padded)."
        },
        {
          "column_name": "REGIMEN_NAME",
          "data_type": "STRING",
          "description": "Business definition\n- REGIMEN_NAME is the human‑readable name of the treatment regimen associated with the patient lot in the claims summaries table. It identifies the therapeutic regimen (drug, drug combination, or non‑drug care pathway) given to the patient or patient cohort.\n\nExpected format and rules\n- Type: string (plain text); can be NULL if regimen is unknown or not applicable.\n- Content: a concise, standardized regimen name or code — not dosing, frequency, or billing codes.\n- Normalization: use a controlled/internal regimen list or established oncology abbreviations where possible (e.g., FOLFOX, R‑CHOP). Prefer uppercase for consistency.\n- Combinations: separate multiple agents with \" + \" or \"/\" (e.g., BEVACIZUMAB + FOLFIRI, CARBOPLATIN/PEMETREXED).\n- Line or intent: if needed, append short qualifiers in parentheses (e.g., \"(1L)\", \"(adjuvant)\", \"(palliative)\").\n- Disallowed: do not include numeric dose, route, or schedule details (e.g., \"50 mg IV q3w\" should not be stored here); avoid embedding patient identifiers or free‑text notes.\n\nExamples\n- FOLFOX\n- R‑CHOP\n- BEVACIZUMAB + FOLFIRI (2L)\n- HORMONE THERAPY (LETROZOLE)\n- PALLIATIVE CARE\n\nRecommended practice\n- Map REGIMEN_NAME values to a canonical regimen dictionary (or RxNorm/SNOMED where appropriate) to support aggregation, reporting, and analytics."
        },
        {
          "column_name": "LINE_START",
          "data_type": "STRING",
          "description": "Business description\n- Purpose: LINE_START identifies the text that marks the beginning of the first line for a patient_lot record. It is used to capture the leading token/label/marker for that record’s multi-line summary so downstream processes can detect, sort or display the record’s starting line.\n\nExpected format and examples\n- Data type: STRING (short, single-line text; no embedded newlines).\n- Typical contents:\n  - a numeric sequence/position expressed as a string, e.g. \"1\", \"0001\"\n  - a date/time stamp (recommended ISO 8601), e.g. \"2024-01-05\" or \"2024-01-05T08:00:00Z\"\n  - a short label or token that denotes the start, e.g. \"LotStart\", \"Patient: John Doe\"\n- Examples: \"1\", \"2024-06-15T09:30:00Z\", \"Lot-ABC123\", \"Start\"\n\nRecommended validation/normalization\n- Must be a single-line string (no newline characters).\n- Trim leading/trailing whitespace.\n- Keep length reasonable (e.g., <= 255 characters).\n- If the value is a date/time, store in ISO 8601 for consistency.\n- If the value represents a numeric index, prefer zero-padded digits (e.g., \"0001\") or store a separate numeric column if arithmetic/sorting is required."
        },
        {
          "column_name": "LINE_END",
          "data_type": "STRING",
          "description": "Business description\n- LINE_END is the service/coverage end date for a claim “line” (the last calendar day that the item/service/coverage represented by this patient_lot record was effective). It indicates when the billing/service period for that line terminated (or the line became inactive) for adjudication, reporting and eligibility calculations.\n\nExpected format and rules\n- Stored as a string but should represent a date in ISO 8601 date form: YYYY-MM-DD (e.g., 2025-03-31).\n- Optional time or timezone components are not expected; if timestamps are present they should follow ISO 8601 (e.g., 2025-03-31T23:59:59Z).\n- Null or empty = no known end date / open-ended.\n- Date must be a valid calendar date and normally should be >= the corresponding LINE_START date. Systems may use a sentinel like 9999-12-31 to indicate “indefinite” coverage—treat that as open-ended.\n\nExamples\n- \"2024-06-30\"\n- \"9999-12-31\" (indefinite)\n- \"\" or NULL (no end date known)"
        },
        {
          "column_name": "IS_ACTIVE",
          "data_type": "INT",
          "description": "Description\n- IS_ACTIVE is a boolean-style flag indicating whether the patient_lot record is currently active for business use (i.e., valid/current vs. inactive/archived).\n\nExpected format and values\n- Data type: INT (integer).\n- Typical values:\n  - 1 = active (currently in use / include in processing and reporting)\n  - 0 = inactive (retired/archived / exclude from regular processing)\n- NULL: may indicate unknown or not set (treat as inactive unless business rule specifies otherwise).\n\nUsage notes\n- Use this column to filter records (WHERE IS_ACTIVE = 1) for operational workflows and reports.\n- Do not infer temporal validity (effective dates) from this flag; check date fields if available for time-bound status."
        },
        {
          "column_name": "CURRENT_LOT",
          "data_type": "STRING",
          "description": "Purpose\n- CURRENT_LOT records the lot (batch) identifier of the product that was associated with a patient claim. It is used for product tracking, recalls, adverse‑event investigation, inventory reconciliation and linking to vendor/manufacturer lot records.\n\nExpected contents and format\n- Free‑form alphanumeric lot/batch code as assigned by the manufacturer or dispenser.\n- Typical characters: uppercase letters, digits, and common separators (hyphen, slash, underscore). Avoid leading/trailing spaces.\n- Recommended pattern for validation (example): /^[A-Z0-9_\\-\\/]{1,50}$/ (adjust length to source system limits).\n- Examples: \"LOT12345\", \"A1B-2023-09\", \"000123\", \"NDCLOT/98765\".\n\nNotes and business rules\n- Field is not necessarily unique; the same lot may appear for many patients.\n- If the lot is unknown, use NULL (preferred) or a standard code such as \"UNKNOWN\" per downstream conventions.\n- Normalize on ingest (trim, uppercase) to improve matching across systems."
        },
        {
          "column_name": "LATEST_LOT",
          "data_type": "STRING",
          "description": "Meaning\n- The most recent product lot (batch) identifier associated with a patient’s claim/dispensing record. It identifies the specific manufacturing batch of the drug/device dispensed to the patient and is used for traceability, recalls, safety investigations and inventory reconciliation.\n\nExpected format\n- A free-form alphanumeric lot/batch identifier stored as a string.\n- Typical contents: letters and digits, may include punctuation such as hyphens, slashes or underscores; may preserve leading zeros and mixed case as provided by the dispenser.\n- Examples: \"123456\", \"AB-98765\", \"LOT2023/01\", \"00012345A\".\n\nConstraints and usage notes\n- Single value: represents the latest (most recent) lot for that patient/claim. If multiple lots were involved and a single field is used, the most recent lot should be populated; avoid concatenating multiple lots in this field.\n- Null/unknown: may be NULL or contain placeholders like \"UNKNOWN\" or \"N/A\" when not captured.\n- Normalization recommendation: trim whitespace and optionally uppercase for consistency; do not alter leading zeros or remove meaningful punctuation.\n- Validation suggestion: allow alphanumeric plus common punctuation (e.g., regex like ^[A-Za-z0-9\\-\\_\\/]+$), but accept exceptions because lot formats vary by manufacturer and country."
        },
        {
          "column_name": "UNIQ_CLAIM_COUNTS",
          "data_type": "LONG",
          "description": "Meaning\n- The total number of distinct insurance claims associated with the given patient_lot record. This represents a deduplicated count of claim events (e.g., distinct claim IDs or claim numbers) attributable to that patient lot over the reporting window defined by the ETL.\n\nExpected format and rules\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, ...). No decimal places.\n- 0 indicates the patient lot has no recorded claims in that period; NULL indicates missing/unknown data.\n- The count is computed after deduplication according to the pipeline’s claim-identity rules (distinct claim identifier), so it should match related aggregate tables that count unique claims."
        },
        {
          "column_name": "UNIQ_PROVIDERS_COUNT",
          "data_type": "LONG",
          "description": "Business description\n- UNIQ_PROVIDERS_COUNT is the count of distinct healthcare providers associated with the claims grouped in this patient_lot. It quantifies how many unique providers (e.g., distinct NPI or internal provider_id) appear across the lot’s claims.\n\nExpected format and rules\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, …). No decimal places.\n- Calculation: count distinct provider identifiers across all claims in the patient_lot; each provider counted once even if they appear on multiple claims.\n- Null/empty handling: 0 indicates no providers found; NULL may be used if provider information is unavailable or the count was not computed.\n- Typical use: measures care fragmentation or provider network breadth for the patient_lot and supports reporting/filters that depend on number of providers."
        },
        {
          "column_name": "UNIQ_REGIMEN_COUNT",
          "data_type": "LONG",
          "description": "Short business description\n- UNIQ_REGIMEN_COUNT is the count of distinct treatment regimens associated with the patient lot in this claims summary. It measures how many different regimens (unique combinations of drugs/procedures identified by regimen code or name) were observed for that patient/lot during the reporting period and is used to indicate treatment complexity or regimen changes.\n\nExpected format and rules\n- Data type: integer (LONG).\n- Allowed values: non‑negative whole numbers (0, 1, 2, ...).  \n- Nullability: may be NULL if no regimen data are available for the patient/lot; otherwise 0 indicates explicit observation with no identified regimen.\n- De‑duplication: counts distinct regimen identifiers (e.g., regimen code or canonical regimen name), so repeat records of the same regimen are counted once.\n- Examples: 0 (no regimen found), 1 (single regimen), 3 (three different regimens observed)."
        },
        {
          "column_name": "UNIQ_PRODUCT_COUNT",
          "data_type": "LONG",
          "description": "Concise business description\n\n- Meaning: The number of distinct products associated with the patient_lot record. In other words, how many unique product SKUs/drug codes/items were linked to that patient’s lot/episode (deduplicated by the product identifier used in the system, e.g., product_id, NDC or SKU).\n- Purpose: Measures product diversity per patient lot for reporting and analysis (e.g., adherence, dispensing complexity, billing).\n- Expected format/constraints:\n  - Data type: integer (LONG).\n  - Values: non‑negative whole numbers (0, 1, 2, …). 0 if no products found for the lot; NULL only if unknown/missing.\n  - No decimals or negative values.\n- Notes/assumptions: Uniqueness is determined by the product identifier in the claims data (specify which identifier in implementation). Ensure consistent deduplication rules (e.g., ignore quantity or duplicate line items) when populating this column."
        },
        {
          "column_name": "AVG_DAYS_SUPPLY_UPD",
          "data_type": "DOUBLE",
          "description": "Business description\n- Meaning: Average number of days’ medication supply per prescription associated with this patient lot, calculated from the updated/processed claims records. (The suffix _UPD indicates the value is derived from the “updated” claim data.)\n- Use: Used to understand typical supply duration per fill for the lot (adherence analysis, utilization reporting, inventory planning).\n\nExpected format and constraints\n- Data type: DOUBLE (numeric, can include fractional days).\n- Units: days.\n- Typical values: positive numbers (commonly in the range 1–365). Zero or NULL indicates no valid supply data for the lot.\n- Precision: stored as a floating point value; commonly shown with 1–2 decimal places (e.g., 30.00, 14.50).\n- Computation: arithmetic mean of the DAYS_SUPPLY_UPD values for all relevant fills in the lot (sum of days supply ÷ count of fills)."
        },
        {
          "column_name": "NO_OF_UNIQ_MONTHS",
          "data_type": "LONG",
          "description": "Meaning\n- The number of distinct calendar months in which the patient had claims within this patient_lot record. This counts distinct year+month combinations (for example, 2024-01 and 2025-01 are different), not days or claim counts.\n\nExpected format / rules\n- Data type: numeric integer (LONG).\n- Allowed values: 0 or positive whole numbers (0 means no claims in the period or no claim dates recorded). Null only if the source data is missing.\n- Granularity: counts unique Year-Month (YYYY-MM) values derived from claim date(s).\n\nExample\n- If a patient has claims dated 2023-11-15, 2023-11-28 and 2023-12-05 → NO_OF_UNIQ_MONTHS = 2.\n\nCalculation hint (example SQL)\n- COUNT(DISTINCT DATE_TRUNC('month', claim_date)) or COUNT(DISTINCT TO_CHAR(claim_date, 'YYYY-MM'))."
        },
        {
          "column_name": "MOST_USED_PROD",
          "data_type": "STRING",
          "description": "Meaning\n- MOST_USED_PROD is the single product (drug, device, or billed item) most frequently used by the patient lot for the summarization period. It identifies which product had the highest usage count/volume for that patient group.\n\nExpected format\n- A string containing either a standardized product identifier or a normalized product name. Preferred formats (in order):\n  1. Standard code (recommended): RxNorm ID, NDC, GPI, or the internal product_id (e.g., \"RXNORM:198440\", \"NDC:12345-6789-01\", \"INT_PROD_000123\").\n  2. Normalized product name if no code available: uppercase, human-readable name (e.g., \"ATORVASTATIN 20 MG TAB\").\n- If multiple products tie, the system should store the chosen tie-breaker (e.g., highest total quantity or most recent use); document the tie rule elsewhere.\n- Missing/unknown values should be NULL (or \"UNKNOWN\" only if NULLs are not permitted).\n\nExamples\n- \"RXNORM:198440\"\n- \"NDC:12345-6789-01\"\n- \"INSULIN GLARGINE 100U/ML\"\n- \"INT_PROD_000123\"\n\nNotes\n- Keep values consistent and preferably coded to enable grouping/joins. Limit length to typical VARCHAR(255) unless otherwise specified."
        },
        {
          "column_name": "MOST_USED_PROD_COUNT",
          "data_type": "LONG",
          "description": "Business description\n- Meaning: The total number of occurrences (claims, fills, administrations or other usage events) for the single product that was used most frequently by the patient within the given patient_lot summary. In other words, this is the frequency count of the most‑used product for that patient/lot during the summary period.\n\nExpected format and rules\n- Data type: LONG (integer).\n- Values: non‑negative whole numbers (0, 1, 2, …). 0 indicates no recorded product usage in the summary period/lot.\n- Nulls: NULL may be used when no summary was computed or source data are missing.\n- Tie handling: if two or more products share the top frequency, this field contains the highest count value (the shared frequency), not a product identifier.\n- Typical usage: combined with a product identifier column (e.g., MOST_USED_PROD_ID) to identify which product the count refers to; used for ranking, segmentation, and usage‑pattern analysis.\n\nExample values: 0, 1, 5, 27."
        },
        {
          "column_name": "IS_NEW",
          "data_type": "INT",
          "description": "Description\n- IS_NEW is a boolean indicator (stored as an INT) that signals whether this patient_lot record is newly created/introduced in the current ingestion or processing cycle.\n\nExpected format and values\n- Data type: INT used as a flag.\n- Permitted values:\n  - 1 = record is new\n  - 0 = record is not new (existing)\n  - NULL = unknown / not set (if applicable)\n- Best practice: constrain to 0/1 and treat as a boolean in queries/reports (e.g., WHERE IS_NEW = 1 to select newly created lots). Recommended default: 0."
        }
      ]
    }
  }
]